MikroElektronika/core_packages/PIC/XC8/def/PIC16F1769/mcu.h
extern volatile SLRCONAbits_t SLRCONAbits __at(0x30C);
// bitfield macros
#define _SLRCONA_SLRA0_POSN                                 0x0
#define _SLRCONA_SLRA0_POSITION                             0x0
#define _SLRCONA_SLRA0_SIZE                                 0x1
#define _SLRCONA_SLRA0_LENGTH                               0x1
#define _SLRCONA_SLRA0_MASK                                 0x1
#define _SLRCONA_SLRA1_POSN                                 0x1
#define _SLRCONA_SLRA1_POSITION                             0x1
#define _SLRCONA_SLRA1_SIZE                                 0x1
#define _SLRCONA_SLRA1_LENGTH                               0x1
#define _SLRCONA_SLRA1_MASK                                 0x2
#define _SLRCONA_SLRA2_POSN                                 0x2
#define _SLRCONA_SLRA2_POSITION                             0x2
#define _SLRCONA_SLRA2_SIZE                                 0x1
#define _SLRCONA_SLRA2_LENGTH                               0x1
#define _SLRCONA_SLRA2_MASK                                 0x4
#define _SLRCONA_SLRA4_POSN                                 0x4
#define _SLRCONA_SLRA4_POSITION                             0x4
#define _SLRCONA_SLRA4_SIZE                                 0x1
#define _SLRCONA_SLRA4_LENGTH                               0x1
#define _SLRCONA_SLRA4_MASK                                 0x10
#define _SLRCONA_SLRA5_POSN                                 0x5
#define _SLRCONA_SLRA5_POSITION                             0x5
#define _SLRCONA_SLRA5_SIZE                                 0x1
#define _SLRCONA_SLRA5_LENGTH                               0x1
#define _SLRCONA_SLRA5_MASK                                 0x20

// Register: SLRCONB
#define SLRCONB SLRCONB
extern volatile unsigned char           SLRCONB             __at(0x30D);
#ifndef _LIB_BUILD
asm("SLRCONB equ 030Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned SLRB4                  :1;
        unsigned SLRB5                  :1;
        unsigned SLRB6                  :1;
        unsigned SLRB7                  :1;
    };
} SLRCONBbits_t;
extern volatile SLRCONBbits_t SLRCONBbits __at(0x30D);
// bitfield macros
#define _SLRCONB_SLRB4_POSN                                 0x4
#define _SLRCONB_SLRB4_POSITION                             0x4
#define _SLRCONB_SLRB4_SIZE                                 0x1
#define _SLRCONB_SLRB4_LENGTH                               0x1
#define _SLRCONB_SLRB4_MASK                                 0x10
#define _SLRCONB_SLRB5_POSN                                 0x5
#define _SLRCONB_SLRB5_POSITION                             0x5
#define _SLRCONB_SLRB5_SIZE                                 0x1
#define _SLRCONB_SLRB5_LENGTH                               0x1
#define _SLRCONB_SLRB5_MASK                                 0x20
#define _SLRCONB_SLRB6_POSN                                 0x6
#define _SLRCONB_SLRB6_POSITION                             0x6
#define _SLRCONB_SLRB6_SIZE                                 0x1
#define _SLRCONB_SLRB6_LENGTH                               0x1
#define _SLRCONB_SLRB6_MASK                                 0x40
#define _SLRCONB_SLRB7_POSN                                 0x7
#define _SLRCONB_SLRB7_POSITION                             0x7
#define _SLRCONB_SLRB7_SIZE                                 0x1
#define _SLRCONB_SLRB7_LENGTH                               0x1
#define _SLRCONB_SLRB7_MASK                                 0x80

// Register: SLRCONC
#define SLRCONC SLRCONC
extern volatile unsigned char           SLRCONC             __at(0x30E);
#ifndef _LIB_BUILD
asm("SLRCONC equ 030Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRC0                  :1;
        unsigned SLRC1                  :1;
        unsigned SLRC2                  :1;
        unsigned SLRC3                  :1;
        unsigned SLRC4                  :1;
        unsigned SLRC5                  :1;
        unsigned SLRC6                  :1;
        unsigned SLRC7                  :1;
    };
} SLRCONCbits_t;
extern volatile SLRCONCbits_t SLRCONCbits __at(0x30E);
// bitfield macros
#define _SLRCONC_SLRC0_POSN                                 0x0
#define _SLRCONC_SLRC0_POSITION                             0x0
#define _SLRCONC_SLRC0_SIZE                                 0x1
#define _SLRCONC_SLRC0_LENGTH                               0x1
#define _SLRCONC_SLRC0_MASK                                 0x1
#define _SLRCONC_SLRC1_POSN                                 0x1
#define _SLRCONC_SLRC1_POSITION                             0x1
#define _SLRCONC_SLRC1_SIZE                                 0x1
#define _SLRCONC_SLRC1_LENGTH                               0x1
#define _SLRCONC_SLRC1_MASK                                 0x2
#define _SLRCONC_SLRC2_POSN                                 0x2
#define _SLRCONC_SLRC2_POSITION                             0x2
#define _SLRCONC_SLRC2_SIZE                                 0x1
#define _SLRCONC_SLRC2_LENGTH                               0x1
#define _SLRCONC_SLRC2_MASK                                 0x4
#define _SLRCONC_SLRC3_POSN                                 0x3
#define _SLRCONC_SLRC3_POSITION                             0x3
#define _SLRCONC_SLRC3_SIZE                                 0x1
#define _SLRCONC_SLRC3_LENGTH                               0x1
#define _SLRCONC_SLRC3_MASK                                 0x8
#define _SLRCONC_SLRC4_POSN                                 0x4
#define _SLRCONC_SLRC4_POSITION                             0x4
#define _SLRCONC_SLRC4_SIZE                                 0x1
#define _SLRCONC_SLRC4_LENGTH                               0x1
#define _SLRCONC_SLRC4_MASK                                 0x10
#define _SLRCONC_SLRC5_POSN                                 0x5
#define _SLRCONC_SLRC5_POSITION                             0x5
#define _SLRCONC_SLRC5_SIZE                                 0x1
#define _SLRCONC_SLRC5_LENGTH                               0x1
#define _SLRCONC_SLRC5_MASK                                 0x20
#define _SLRCONC_SLRC6_POSN                                 0x6
#define _SLRCONC_SLRC6_POSITION                             0x6
#define _SLRCONC_SLRC6_SIZE                                 0x1
#define _SLRCONC_SLRC6_LENGTH                               0x1
#define _SLRCONC_SLRC6_MASK                                 0x40
#define _SLRCONC_SLRC7_POSN                                 0x7
#define _SLRCONC_SLRC7_POSITION                             0x7
#define _SLRCONC_SLRC7_SIZE                                 0x1
#define _SLRCONC_SLRC7_LENGTH                               0x1
#define _SLRCONC_SLRC7_MASK                                 0x80

// Register: MD2CON0
#define MD2CON0 MD2CON0
extern volatile unsigned char           MD2CON0             __at(0x31B);
#ifndef _LIB_BUILD
asm("MD2CON0 equ 031Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BIT                    :1;
        unsigned                        :3;
        unsigned OPOL                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MD2BIT                 :1;
        unsigned                        :3;
        unsigned MD2OPOL                :1;
        unsigned MD2OUT                 :1;
        unsigned                        :1;
        unsigned MD2EN                  :1;
    };
} MD2CON0bits_t;
extern volatile MD2CON0bits_t MD2CON0bits __at(0x31B);
// bitfield macros
#define _MD2CON0_BIT_POSN                                   0x0
#define _MD2CON0_BIT_POSITION                               0x0
#define _MD2CON0_BIT_SIZE                                   0x1
#define _MD2CON0_BIT_LENGTH                                 0x1
#define _MD2CON0_BIT_MASK                                   0x1
#define _MD2CON0_OPOL_POSN                                  0x4
#define _MD2CON0_OPOL_POSITION                              0x4
#define _MD2CON0_OPOL_SIZE                                  0x1
#define _MD2CON0_OPOL_LENGTH                                0x1
#define _MD2CON0_OPOL_MASK                                  0x10
#define _MD2CON0_OUT_POSN                                   0x5
#define _MD2CON0_OUT_POSITION                               0x5
#define _MD2CON0_OUT_SIZE                                   0x1
#define _MD2CON0_OUT_LENGTH                                 0x1
#define _MD2CON0_OUT_MASK                                   0x20
#define _MD2CON0_EN_POSN                                    0x7
#define _MD2CON0_EN_POSITION                                0x7
#define _MD2CON0_EN_SIZE                                    0x1
#define _MD2CON0_EN_LENGTH                                  0x1
#define _MD2CON0_EN_MASK                                    0x80
#define _MD2CON0_MD2BIT_POSN                                0x0
#define _MD2CON0_MD2BIT_POSITION                            0x0
#define _MD2CON0_MD2BIT_SIZE                                0x1
#define _MD2CON0_MD2BIT_LENGTH                              0x1
#define _MD2CON0_MD2BIT_MASK                                0x1
#define _MD2CON0_MD2OPOL_POSN                               0x4
#define _MD2CON0_MD2OPOL_POSITION                           0x4
#define _MD2CON0_MD2OPOL_SIZE                               0x1
#define _MD2CON0_MD2OPOL_LENGTH                             0x1
#define _MD2CON0_MD2OPOL_MASK                               0x10
#define _MD2CON0_MD2OUT_POSN                                0x5
#define _MD2CON0_MD2OUT_POSITION                            0x5
#define _MD2CON0_MD2OUT_SIZE                                0x1
#define _MD2CON0_MD2OUT_LENGTH                              0x1
#define _MD2CON0_MD2OUT_MASK                                0x20
#define _MD2CON0_MD2EN_POSN                                 0x7
#define _MD2CON0_MD2EN_POSITION                             0x7
#define _MD2CON0_MD2EN_SIZE                                 0x1
#define _MD2CON0_MD2EN_LENGTH                               0x1
#define _MD2CON0_MD2EN_MASK                                 0x80

