MikroElektronika/core_packages/PIC/XC8/def/PIC16F1769/mcu.h
extern volatile DAC4CON1bits_t DAC4CON1bits __at(0x59A);
// bitfield macros
#define _DAC4CON1_DACR_POSN                                 0x0
#define _DAC4CON1_DACR_POSITION                             0x0
#define _DAC4CON1_DACR_SIZE                                 0x5
#define _DAC4CON1_DACR_LENGTH                               0x5
#define _DAC4CON1_DACR_MASK                                 0x1F
#define _DAC4CON1_DACR0_POSN                                0x0
#define _DAC4CON1_DACR0_POSITION                            0x0
#define _DAC4CON1_DACR0_SIZE                                0x1
#define _DAC4CON1_DACR0_LENGTH                              0x1
#define _DAC4CON1_DACR0_MASK                                0x1
#define _DAC4CON1_DACR1_POSN                                0x1
#define _DAC4CON1_DACR1_POSITION                            0x1
#define _DAC4CON1_DACR1_SIZE                                0x1
#define _DAC4CON1_DACR1_LENGTH                              0x1
#define _DAC4CON1_DACR1_MASK                                0x2
#define _DAC4CON1_DACR2_POSN                                0x2
#define _DAC4CON1_DACR2_POSITION                            0x2
#define _DAC4CON1_DACR2_SIZE                                0x1
#define _DAC4CON1_DACR2_LENGTH                              0x1
#define _DAC4CON1_DACR2_MASK                                0x4
#define _DAC4CON1_DACR3_POSN                                0x3
#define _DAC4CON1_DACR3_POSITION                            0x3
#define _DAC4CON1_DACR3_SIZE                                0x1
#define _DAC4CON1_DACR3_LENGTH                              0x1
#define _DAC4CON1_DACR3_MASK                                0x8
#define _DAC4CON1_DACR4_POSN                                0x4
#define _DAC4CON1_DACR4_POSITION                            0x4
#define _DAC4CON1_DACR4_SIZE                                0x1
#define _DAC4CON1_DACR4_LENGTH                              0x1
#define _DAC4CON1_DACR4_MASK                                0x10
#define _DAC4CON1_R0_POSN                                   0x0
#define _DAC4CON1_R0_POSITION                               0x0
#define _DAC4CON1_R0_SIZE                                   0x1
#define _DAC4CON1_R0_LENGTH                                 0x1
#define _DAC4CON1_R0_MASK                                   0x1
#define _DAC4CON1_R1_POSN                                   0x1
#define _DAC4CON1_R1_POSITION                               0x1
#define _DAC4CON1_R1_SIZE                                   0x1
#define _DAC4CON1_R1_LENGTH                                 0x1
#define _DAC4CON1_R1_MASK                                   0x2
#define _DAC4CON1_R2_POSN                                   0x2
#define _DAC4CON1_R2_POSITION                               0x2
#define _DAC4CON1_R2_SIZE                                   0x1
#define _DAC4CON1_R2_LENGTH                                 0x1
#define _DAC4CON1_R2_MASK                                   0x4
#define _DAC4CON1_R3_POSN                                   0x3
#define _DAC4CON1_R3_POSITION                               0x3
#define _DAC4CON1_R3_SIZE                                   0x1
#define _DAC4CON1_R3_LENGTH                                 0x1
#define _DAC4CON1_R3_MASK                                   0x8
#define _DAC4CON1_R4_POSN                                   0x4
#define _DAC4CON1_R4_POSITION                               0x4
#define _DAC4CON1_R4_SIZE                                   0x1
#define _DAC4CON1_R4_LENGTH                                 0x1
#define _DAC4CON1_R4_MASK                                   0x10
#define _DAC4CON1_DAC4R_POSN                                0x0
#define _DAC4CON1_DAC4R_POSITION                            0x0
#define _DAC4CON1_DAC4R_SIZE                                0x5
#define _DAC4CON1_DAC4R_LENGTH                              0x5
#define _DAC4CON1_DAC4R_MASK                                0x1F
#define _DAC4CON1_DAC4R0_POSN                               0x0
#define _DAC4CON1_DAC4R0_POSITION                           0x0
#define _DAC4CON1_DAC4R0_SIZE                               0x1
#define _DAC4CON1_DAC4R0_LENGTH                             0x1
#define _DAC4CON1_DAC4R0_MASK                               0x1
#define _DAC4CON1_DAC4R1_POSN                               0x1
#define _DAC4CON1_DAC4R1_POSITION                           0x1
#define _DAC4CON1_DAC4R1_SIZE                               0x1
#define _DAC4CON1_DAC4R1_LENGTH                             0x1
#define _DAC4CON1_DAC4R1_MASK                               0x2
#define _DAC4CON1_DAC4R2_POSN                               0x2
#define _DAC4CON1_DAC4R2_POSITION                           0x2
#define _DAC4CON1_DAC4R2_SIZE                               0x1
#define _DAC4CON1_DAC4R2_LENGTH                             0x1
#define _DAC4CON1_DAC4R2_MASK                               0x4
#define _DAC4CON1_DAC4R3_POSN                               0x3
#define _DAC4CON1_DAC4R3_POSITION                           0x3
#define _DAC4CON1_DAC4R3_SIZE                               0x1
#define _DAC4CON1_DAC4R3_LENGTH                             0x1
#define _DAC4CON1_DAC4R3_MASK                               0x8
#define _DAC4CON1_DAC4R4_POSN                               0x4
#define _DAC4CON1_DAC4R4_POSITION                           0x4
#define _DAC4CON1_DAC4R4_SIZE                               0x1
#define _DAC4CON1_DAC4R4_LENGTH                             0x1
#define _DAC4CON1_DAC4R4_MASK                               0x10
#define _DAC4CON1_REF0_POSN                                 0x0
#define _DAC4CON1_REF0_POSITION                             0x0
#define _DAC4CON1_REF0_SIZE                                 0x1
#define _DAC4CON1_REF0_LENGTH                               0x1
#define _DAC4CON1_REF0_MASK                                 0x1
#define _DAC4CON1_REF1_POSN                                 0x1
#define _DAC4CON1_REF1_POSITION                             0x1
#define _DAC4CON1_REF1_SIZE                                 0x1
#define _DAC4CON1_REF1_LENGTH                               0x1
#define _DAC4CON1_REF1_MASK                                 0x2
#define _DAC4CON1_REF2_POSN                                 0x2
#define _DAC4CON1_REF2_POSITION                             0x2
#define _DAC4CON1_REF2_SIZE                                 0x1
#define _DAC4CON1_REF2_LENGTH                               0x1
#define _DAC4CON1_REF2_MASK                                 0x4
#define _DAC4CON1_REF3_POSN                                 0x3
#define _DAC4CON1_REF3_POSITION                             0x3
#define _DAC4CON1_REF3_SIZE                                 0x1
#define _DAC4CON1_REF3_LENGTH                               0x1
#define _DAC4CON1_REF3_MASK                                 0x8
#define _DAC4CON1_REF4_POSN                                 0x4
#define _DAC4CON1_REF4_POSITION                             0x4
#define _DAC4CON1_REF4_SIZE                                 0x1
#define _DAC4CON1_REF4_LENGTH                               0x1
#define _DAC4CON1_REF4_MASK                                 0x10
#define _DAC4CON1_REF5_POSN                                 0x5
#define _DAC4CON1_REF5_POSITION                             0x5
#define _DAC4CON1_REF5_SIZE                                 0x1
#define _DAC4CON1_REF5_LENGTH                               0x1
#define _DAC4CON1_REF5_MASK                                 0x20
#define _DAC4CON1_DAC4REF0_POSN                             0x0
#define _DAC4CON1_DAC4REF0_POSITION                         0x0
#define _DAC4CON1_DAC4REF0_SIZE                             0x1
#define _DAC4CON1_DAC4REF0_LENGTH                           0x1
#define _DAC4CON1_DAC4REF0_MASK                             0x1
#define _DAC4CON1_DAC4REF1_POSN                             0x1
#define _DAC4CON1_DAC4REF1_POSITION                         0x1
#define _DAC4CON1_DAC4REF1_SIZE                             0x1
#define _DAC4CON1_DAC4REF1_LENGTH                           0x1
#define _DAC4CON1_DAC4REF1_MASK                             0x2
#define _DAC4CON1_DAC4REF2_POSN                             0x2
#define _DAC4CON1_DAC4REF2_POSITION                         0x2
#define _DAC4CON1_DAC4REF2_SIZE                             0x1
#define _DAC4CON1_DAC4REF2_LENGTH                           0x1
#define _DAC4CON1_DAC4REF2_MASK                             0x4
#define _DAC4CON1_DAC4REF3_POSN                             0x3
#define _DAC4CON1_DAC4REF3_POSITION                         0x3
#define _DAC4CON1_DAC4REF3_SIZE                             0x1
#define _DAC4CON1_DAC4REF3_LENGTH                           0x1
#define _DAC4CON1_DAC4REF3_MASK                             0x8
#define _DAC4CON1_DAC4REF4_POSN                             0x4
#define _DAC4CON1_DAC4REF4_POSITION                         0x4
#define _DAC4CON1_DAC4REF4_SIZE                             0x1
#define _DAC4CON1_DAC4REF4_LENGTH                           0x1
#define _DAC4CON1_DAC4REF4_MASK                             0x10
#define _DAC4CON1_DAC4REF5_POSN                             0x5
#define _DAC4CON1_DAC4REF5_POSITION                         0x5
#define _DAC4CON1_DAC4REF5_SIZE                             0x1
#define _DAC4CON1_DAC4REF5_LENGTH                           0x1
#define _DAC4CON1_DAC4REF5_MASK                             0x20

// Register: PWM3DC
#define PWM3DC PWM3DC
extern volatile unsigned short          PWM3DC              __at(0x617);
#ifndef _LIB_BUILD
asm("PWM3DC equ 0617h");
#endif

