MikroElektronika/core_packages/PIC/XC8/def/PIC16F1769/mcu.h
extern volatile PRG1CON0bits_t PRG1CON0bits __at(0x797);
// bitfield macros
#define _PRG1CON0_GO_POSN                                   0x0
#define _PRG1CON0_GO_POSITION                               0x0
#define _PRG1CON0_GO_SIZE                                   0x1
#define _PRG1CON0_GO_LENGTH                                 0x1
#define _PRG1CON0_GO_MASK                                   0x1
#define _PRG1CON0_OS_POSN                                   0x1
#define _PRG1CON0_OS_POSITION                               0x1
#define _PRG1CON0_OS_SIZE                                   0x1
#define _PRG1CON0_OS_LENGTH                                 0x1
#define _PRG1CON0_OS_MASK                                   0x2
#define _PRG1CON0_MODE_POSN                                 0x2
#define _PRG1CON0_MODE_POSITION                             0x2
#define _PRG1CON0_MODE_SIZE                                 0x2
#define _PRG1CON0_MODE_LENGTH                               0x2
#define _PRG1CON0_MODE_MASK                                 0xC
#define _PRG1CON0_REDG_POSN                                 0x4
#define _PRG1CON0_REDG_POSITION                             0x4
#define _PRG1CON0_REDG_SIZE                                 0x1
#define _PRG1CON0_REDG_LENGTH                               0x1
#define _PRG1CON0_REDG_MASK                                 0x10
#define _PRG1CON0_FEDG_POSN                                 0x5
#define _PRG1CON0_FEDG_POSITION                             0x5
#define _PRG1CON0_FEDG_SIZE                                 0x1
#define _PRG1CON0_FEDG_LENGTH                               0x1
#define _PRG1CON0_FEDG_MASK                                 0x20
#define _PRG1CON0_EN_POSN                                   0x7
#define _PRG1CON0_EN_POSITION                               0x7
#define _PRG1CON0_EN_SIZE                                   0x1
#define _PRG1CON0_EN_LENGTH                                 0x1
#define _PRG1CON0_EN_MASK                                   0x80
#define _PRG1CON0_MODE0_POSN                                0x2
#define _PRG1CON0_MODE0_POSITION                            0x2
#define _PRG1CON0_MODE0_SIZE                                0x1
#define _PRG1CON0_MODE0_LENGTH                              0x1
#define _PRG1CON0_MODE0_MASK                                0x4
#define _PRG1CON0_MODE1_POSN                                0x3
#define _PRG1CON0_MODE1_POSITION                            0x3
#define _PRG1CON0_MODE1_SIZE                                0x1
#define _PRG1CON0_MODE1_LENGTH                              0x1
#define _PRG1CON0_MODE1_MASK                                0x8
#define _PRG1CON0_RG1GO_POSN                                0x0
#define _PRG1CON0_RG1GO_POSITION                            0x0
#define _PRG1CON0_RG1GO_SIZE                                0x1
#define _PRG1CON0_RG1GO_LENGTH                              0x1
#define _PRG1CON0_RG1GO_MASK                                0x1
#define _PRG1CON0_RG1OS_POSN                                0x1
#define _PRG1CON0_RG1OS_POSITION                            0x1
#define _PRG1CON0_RG1OS_SIZE                                0x1
#define _PRG1CON0_RG1OS_LENGTH                              0x1
#define _PRG1CON0_RG1OS_MASK                                0x2
#define _PRG1CON0_RG1MODE_POSN                              0x2
#define _PRG1CON0_RG1MODE_POSITION                          0x2
#define _PRG1CON0_RG1MODE_SIZE                              0x2
#define _PRG1CON0_RG1MODE_LENGTH                            0x2
#define _PRG1CON0_RG1MODE_MASK                              0xC
#define _PRG1CON0_RG1REDG_POSN                              0x4
#define _PRG1CON0_RG1REDG_POSITION                          0x4
#define _PRG1CON0_RG1REDG_SIZE                              0x1
#define _PRG1CON0_RG1REDG_LENGTH                            0x1
#define _PRG1CON0_RG1REDG_MASK                              0x10
#define _PRG1CON0_RG1FEDG_POSN                              0x5
#define _PRG1CON0_RG1FEDG_POSITION                          0x5
#define _PRG1CON0_RG1FEDG_SIZE                              0x1
#define _PRG1CON0_RG1FEDG_LENGTH                            0x1
#define _PRG1CON0_RG1FEDG_MASK                              0x20
#define _PRG1CON0_RG1EN_POSN                                0x7
#define _PRG1CON0_RG1EN_POSITION                            0x7
#define _PRG1CON0_RG1EN_SIZE                                0x1
#define _PRG1CON0_RG1EN_LENGTH                              0x1
#define _PRG1CON0_RG1EN_MASK                                0x80
#define _PRG1CON0_RG1MODE0_POSN                             0x2
#define _PRG1CON0_RG1MODE0_POSITION                         0x2
#define _PRG1CON0_RG1MODE0_SIZE                             0x1
#define _PRG1CON0_RG1MODE0_LENGTH                           0x1
#define _PRG1CON0_RG1MODE0_MASK                             0x4
#define _PRG1CON0_RG1MODE1_POSN                             0x3
#define _PRG1CON0_RG1MODE1_POSITION                         0x3
#define _PRG1CON0_RG1MODE1_SIZE                             0x1
#define _PRG1CON0_RG1MODE1_LENGTH                           0x1
#define _PRG1CON0_RG1MODE1_MASK                             0x8

// Register: PRG1CON1
#define PRG1CON1 PRG1CON1
extern volatile unsigned char           PRG1CON1            __at(0x798);
#ifndef _LIB_BUILD
asm("PRG1CON1 equ 0798h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RPOL                   :1;
        unsigned FPOL                   :1;
        unsigned RDY                    :1;
    };
    struct {
        unsigned RG1RPOL                :1;
        unsigned RG1FPOL                :1;
        unsigned RG1RDY                 :1;
    };
} PRG1CON1bits_t;
extern volatile PRG1CON1bits_t PRG1CON1bits __at(0x798);
// bitfield macros
#define _PRG1CON1_RPOL_POSN                                 0x0
#define _PRG1CON1_RPOL_POSITION                             0x0
#define _PRG1CON1_RPOL_SIZE                                 0x1
#define _PRG1CON1_RPOL_LENGTH                               0x1
#define _PRG1CON1_RPOL_MASK                                 0x1
#define _PRG1CON1_FPOL_POSN                                 0x1
#define _PRG1CON1_FPOL_POSITION                             0x1
#define _PRG1CON1_FPOL_SIZE                                 0x1
#define _PRG1CON1_FPOL_LENGTH                               0x1
#define _PRG1CON1_FPOL_MASK                                 0x2
#define _PRG1CON1_RDY_POSN                                  0x2
#define _PRG1CON1_RDY_POSITION                              0x2
#define _PRG1CON1_RDY_SIZE                                  0x1
#define _PRG1CON1_RDY_LENGTH                                0x1
#define _PRG1CON1_RDY_MASK                                  0x4
#define _PRG1CON1_RG1RPOL_POSN                              0x0
#define _PRG1CON1_RG1RPOL_POSITION                          0x0
#define _PRG1CON1_RG1RPOL_SIZE                              0x1
#define _PRG1CON1_RG1RPOL_LENGTH                            0x1
#define _PRG1CON1_RG1RPOL_MASK                              0x1
#define _PRG1CON1_RG1FPOL_POSN                              0x1
#define _PRG1CON1_RG1FPOL_POSITION                          0x1
#define _PRG1CON1_RG1FPOL_SIZE                              0x1
#define _PRG1CON1_RG1FPOL_LENGTH                            0x1
#define _PRG1CON1_RG1FPOL_MASK                              0x2
#define _PRG1CON1_RG1RDY_POSN                               0x2
#define _PRG1CON1_RG1RDY_POSITION                           0x2
#define _PRG1CON1_RG1RDY_SIZE                               0x1
#define _PRG1CON1_RG1RDY_LENGTH                             0x1
#define _PRG1CON1_RG1RDY_MASK                               0x4

// Register: PRG1CON2
#define PRG1CON2 PRG1CON2
extern volatile unsigned char           PRG1CON2            __at(0x799);
#ifndef _LIB_BUILD
asm("PRG1CON2 equ 0799h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ISET                   :5;
        unsigned                        :2;
        unsigned LR                     :1;
    };
    struct {
        unsigned ISET0                  :1;
        unsigned ISET1                  :1;
        unsigned ISET2                  :1;
        unsigned ISET3                  :1;
        unsigned ISET4                  :1;
    };
    struct {
        unsigned RG1ISET                :5;
    };
    struct {
        unsigned RG1ISET0               :1;
        unsigned RG1ISET1               :1;
        unsigned RG1ISET2               :1;
        unsigned RG1ISET3               :1;
        unsigned RG1ISET4               :1;
    };
} PRG1CON2bits_t;
extern volatile PRG1CON2bits_t PRG1CON2bits __at(0x799);
// bitfield macros
#define _PRG1CON2_ISET_POSN                                 0x0
#define _PRG1CON2_ISET_POSITION                             0x0
#define _PRG1CON2_ISET_SIZE                                 0x5
#define _PRG1CON2_ISET_LENGTH                               0x5
#define _PRG1CON2_ISET_MASK                                 0x1F
#define _PRG1CON2_LR_POSN                                   0x7
#define _PRG1CON2_LR_POSITION                               0x7
#define _PRG1CON2_LR_SIZE                                   0x1
#define _PRG1CON2_LR_LENGTH                                 0x1
#define _PRG1CON2_LR_MASK                                   0x80
#define _PRG1CON2_ISET0_POSN                                0x0
#define _PRG1CON2_ISET0_POSITION                            0x0
#define _PRG1CON2_ISET0_SIZE                                0x1
#define _PRG1CON2_ISET0_LENGTH                              0x1
#define _PRG1CON2_ISET0_MASK                                0x1
#define _PRG1CON2_ISET1_POSN                                0x1
#define _PRG1CON2_ISET1_POSITION                            0x1
#define _PRG1CON2_ISET1_SIZE                                0x1
#define _PRG1CON2_ISET1_LENGTH                              0x1
#define _PRG1CON2_ISET1_MASK                                0x2
#define _PRG1CON2_ISET2_POSN                                0x2
#define _PRG1CON2_ISET2_POSITION                            0x2
#define _PRG1CON2_ISET2_SIZE                                0x1
#define _PRG1CON2_ISET2_LENGTH                              0x1
#define _PRG1CON2_ISET2_MASK                                0x4
#define _PRG1CON2_ISET3_POSN                                0x3
#define _PRG1CON2_ISET3_POSITION                            0x3
#define _PRG1CON2_ISET3_SIZE                                0x1
#define _PRG1CON2_ISET3_LENGTH                              0x1
#define _PRG1CON2_ISET3_MASK                                0x8
#define _PRG1CON2_ISET4_POSN                                0x4
#define _PRG1CON2_ISET4_POSITION                            0x4
#define _PRG1CON2_ISET4_SIZE                                0x1
#define _PRG1CON2_ISET4_LENGTH                              0x1
#define _PRG1CON2_ISET4_MASK                                0x10
#define _PRG1CON2_RG1ISET_POSN                              0x0
#define _PRG1CON2_RG1ISET_POSITION                          0x0
#define _PRG1CON2_RG1ISET_SIZE                              0x5
#define _PRG1CON2_RG1ISET_LENGTH                            0x5
#define _PRG1CON2_RG1ISET_MASK                              0x1F
#define _PRG1CON2_RG1ISET0_POSN                             0x0
#define _PRG1CON2_RG1ISET0_POSITION                         0x0
#define _PRG1CON2_RG1ISET0_SIZE                             0x1
#define _PRG1CON2_RG1ISET0_LENGTH                           0x1
#define _PRG1CON2_RG1ISET0_MASK                             0x1
#define _PRG1CON2_RG1ISET1_POSN                             0x1
#define _PRG1CON2_RG1ISET1_POSITION                         0x1
#define _PRG1CON2_RG1ISET1_SIZE                             0x1
#define _PRG1CON2_RG1ISET1_LENGTH                           0x1
#define _PRG1CON2_RG1ISET1_MASK                             0x2
#define _PRG1CON2_RG1ISET2_POSN                             0x2
#define _PRG1CON2_RG1ISET2_POSITION                         0x2
#define _PRG1CON2_RG1ISET2_SIZE                             0x1
#define _PRG1CON2_RG1ISET2_LENGTH                           0x1
#define _PRG1CON2_RG1ISET2_MASK                             0x4
#define _PRG1CON2_RG1ISET3_POSN                             0x3
#define _PRG1CON2_RG1ISET3_POSITION                         0x3
#define _PRG1CON2_RG1ISET3_SIZE                             0x1
#define _PRG1CON2_RG1ISET3_LENGTH                           0x1
#define _PRG1CON2_RG1ISET3_MASK                             0x8
#define _PRG1CON2_RG1ISET4_POSN                             0x4
#define _PRG1CON2_RG1ISET4_POSITION                         0x4
#define _PRG1CON2_RG1ISET4_SIZE                             0x1
#define _PRG1CON2_RG1ISET4_LENGTH                           0x1
#define _PRG1CON2_RG1ISET4_MASK                             0x10

// Register: PRG2RTSS
#define PRG2RTSS PRG2RTSS
extern volatile unsigned char           PRG2RTSS            __at(0x79A);
#ifndef _LIB_BUILD
asm("PRG2RTSS equ 079Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RTSS                   :8;
    };
    struct {
        unsigned RTSS0                  :1;
        unsigned RTSS1                  :1;
        unsigned RTSS2                  :1;
        unsigned RTSS3                  :1;
    };
    struct {
        unsigned RG2RTSS0               :1;
        unsigned RG2RTSS1               :1;
        unsigned RG2RTSS2               :1;
        unsigned RG2RTSS3               :1;
    };
} PRG2RTSSbits_t;
extern volatile PRG2RTSSbits_t PRG2RTSSbits __at(0x79A);
// bitfield macros
#define _PRG2RTSS_RTSS_POSN                                 0x0
#define _PRG2RTSS_RTSS_POSITION                             0x0
#define _PRG2RTSS_RTSS_SIZE                                 0x8
#define _PRG2RTSS_RTSS_LENGTH                               0x8
#define _PRG2RTSS_RTSS_MASK                                 0xFF
#define _PRG2RTSS_RTSS0_POSN                                0x0
#define _PRG2RTSS_RTSS0_POSITION                            0x0
#define _PRG2RTSS_RTSS0_SIZE                                0x1
#define _PRG2RTSS_RTSS0_LENGTH                              0x1
#define _PRG2RTSS_RTSS0_MASK                                0x1
#define _PRG2RTSS_RTSS1_POSN                                0x1
#define _PRG2RTSS_RTSS1_POSITION                            0x1
#define _PRG2RTSS_RTSS1_SIZE                                0x1
#define _PRG2RTSS_RTSS1_LENGTH                              0x1
#define _PRG2RTSS_RTSS1_MASK                                0x2
#define _PRG2RTSS_RTSS2_POSN                                0x2
#define _PRG2RTSS_RTSS2_POSITION                            0x2
#define _PRG2RTSS_RTSS2_SIZE                                0x1
#define _PRG2RTSS_RTSS2_LENGTH                              0x1
#define _PRG2RTSS_RTSS2_MASK                                0x4
#define _PRG2RTSS_RTSS3_POSN                                0x3
#define _PRG2RTSS_RTSS3_POSITION                            0x3
#define _PRG2RTSS_RTSS3_SIZE                                0x1
#define _PRG2RTSS_RTSS3_LENGTH                              0x1
#define _PRG2RTSS_RTSS3_MASK                                0x8
#define _PRG2RTSS_RG2RTSS0_POSN                             0x0
#define _PRG2RTSS_RG2RTSS0_POSITION                         0x0
#define _PRG2RTSS_RG2RTSS0_SIZE                             0x1
#define _PRG2RTSS_RG2RTSS0_LENGTH                           0x1
#define _PRG2RTSS_RG2RTSS0_MASK                             0x1
#define _PRG2RTSS_RG2RTSS1_POSN                             0x1
#define _PRG2RTSS_RG2RTSS1_POSITION                         0x1
#define _PRG2RTSS_RG2RTSS1_SIZE                             0x1
#define _PRG2RTSS_RG2RTSS1_LENGTH                           0x1
#define _PRG2RTSS_RG2RTSS1_MASK                             0x2
#define _PRG2RTSS_RG2RTSS2_POSN                             0x2
#define _PRG2RTSS_RG2RTSS2_POSITION                         0x2
#define _PRG2RTSS_RG2RTSS2_SIZE                             0x1
#define _PRG2RTSS_RG2RTSS2_LENGTH                           0x1
#define _PRG2RTSS_RG2RTSS2_MASK                             0x4
#define _PRG2RTSS_RG2RTSS3_POSN                             0x3
#define _PRG2RTSS_RG2RTSS3_POSITION                         0x3
#define _PRG2RTSS_RG2RTSS3_SIZE                             0x1
#define _PRG2RTSS_RG2RTSS3_LENGTH                           0x1
#define _PRG2RTSS_RG2RTSS3_MASK                             0x8

// Register: PRG2FTSS
#define PRG2FTSS PRG2FTSS
extern volatile unsigned char           PRG2FTSS            __at(0x79B);
#ifndef _LIB_BUILD
asm("PRG2FTSS equ 079Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FTSS                   :8;
    };
    struct {
        unsigned FTSS0                  :1;
        unsigned FTSS1                  :1;
        unsigned FTSS2                  :1;
        unsigned FTSS3                  :1;
    };
    struct {
        unsigned RG2FTSS0               :1;
        unsigned RG2FTSS1               :1;
        unsigned RG2FTSS2               :1;
        unsigned RG2FTSS3               :1;
    };
} PRG2FTSSbits_t;
extern volatile PRG2FTSSbits_t PRG2FTSSbits __at(0x79B);
// bitfield macros
#define _PRG2FTSS_FTSS_POSN                                 0x0
#define _PRG2FTSS_FTSS_POSITION                             0x0
#define _PRG2FTSS_FTSS_SIZE                                 0x8
#define _PRG2FTSS_FTSS_LENGTH                               0x8
#define _PRG2FTSS_FTSS_MASK                                 0xFF
#define _PRG2FTSS_FTSS0_POSN                                0x0
#define _PRG2FTSS_FTSS0_POSITION                            0x0
#define _PRG2FTSS_FTSS0_SIZE                                0x1
#define _PRG2FTSS_FTSS0_LENGTH                              0x1
#define _PRG2FTSS_FTSS0_MASK                                0x1
#define _PRG2FTSS_FTSS1_POSN                                0x1
#define _PRG2FTSS_FTSS1_POSITION                            0x1
#define _PRG2FTSS_FTSS1_SIZE                                0x1
#define _PRG2FTSS_FTSS1_LENGTH                              0x1
#define _PRG2FTSS_FTSS1_MASK                                0x2
#define _PRG2FTSS_FTSS2_POSN                                0x2
#define _PRG2FTSS_FTSS2_POSITION                            0x2
#define _PRG2FTSS_FTSS2_SIZE                                0x1
#define _PRG2FTSS_FTSS2_LENGTH                              0x1
#define _PRG2FTSS_FTSS2_MASK                                0x4
#define _PRG2FTSS_FTSS3_POSN                                0x3
#define _PRG2FTSS_FTSS3_POSITION                            0x3
#define _PRG2FTSS_FTSS3_SIZE                                0x1
#define _PRG2FTSS_FTSS3_LENGTH                              0x1
#define _PRG2FTSS_FTSS3_MASK                                0x8
#define _PRG2FTSS_RG2FTSS0_POSN                             0x0
#define _PRG2FTSS_RG2FTSS0_POSITION                         0x0
#define _PRG2FTSS_RG2FTSS0_SIZE                             0x1
#define _PRG2FTSS_RG2FTSS0_LENGTH                           0x1
#define _PRG2FTSS_RG2FTSS0_MASK                             0x1
#define _PRG2FTSS_RG2FTSS1_POSN                             0x1
#define _PRG2FTSS_RG2FTSS1_POSITION                         0x1
#define _PRG2FTSS_RG2FTSS1_SIZE                             0x1
#define _PRG2FTSS_RG2FTSS1_LENGTH                           0x1
#define _PRG2FTSS_RG2FTSS1_MASK                             0x2
#define _PRG2FTSS_RG2FTSS2_POSN                             0x2
#define _PRG2FTSS_RG2FTSS2_POSITION                         0x2
#define _PRG2FTSS_RG2FTSS2_SIZE                             0x1
#define _PRG2FTSS_RG2FTSS2_LENGTH                           0x1
#define _PRG2FTSS_RG2FTSS2_MASK                             0x4
#define _PRG2FTSS_RG2FTSS3_POSN                             0x3
#define _PRG2FTSS_RG2FTSS3_POSITION                         0x3
#define _PRG2FTSS_RG2FTSS3_SIZE                             0x1
#define _PRG2FTSS_RG2FTSS3_LENGTH                           0x1
#define _PRG2FTSS_RG2FTSS3_MASK                             0x8

