MikroElektronika/core_packages/PIC/XC8/def/PIC16F1769/mcu.h
extern volatile PRG2CON1bits_t PRG2CON1bits __at(0x79E);
// bitfield macros
#define _PRG2CON1_RPOL_POSN                                 0x0
#define _PRG2CON1_RPOL_POSITION                             0x0
#define _PRG2CON1_RPOL_SIZE                                 0x1
#define _PRG2CON1_RPOL_LENGTH                               0x1
#define _PRG2CON1_RPOL_MASK                                 0x1
#define _PRG2CON1_FPOL_POSN                                 0x1
#define _PRG2CON1_FPOL_POSITION                             0x1
#define _PRG2CON1_FPOL_SIZE                                 0x1
#define _PRG2CON1_FPOL_LENGTH                               0x1
#define _PRG2CON1_FPOL_MASK                                 0x2
#define _PRG2CON1_RDY_POSN                                  0x2
#define _PRG2CON1_RDY_POSITION                              0x2
#define _PRG2CON1_RDY_SIZE                                  0x1
#define _PRG2CON1_RDY_LENGTH                                0x1
#define _PRG2CON1_RDY_MASK                                  0x4
#define _PRG2CON1_RG2RPOL_POSN                              0x0
#define _PRG2CON1_RG2RPOL_POSITION                          0x0
#define _PRG2CON1_RG2RPOL_SIZE                              0x1
#define _PRG2CON1_RG2RPOL_LENGTH                            0x1
#define _PRG2CON1_RG2RPOL_MASK                              0x1
#define _PRG2CON1_RG2FPOL_POSN                              0x1
#define _PRG2CON1_RG2FPOL_POSITION                          0x1
#define _PRG2CON1_RG2FPOL_SIZE                              0x1
#define _PRG2CON1_RG2FPOL_LENGTH                            0x1
#define _PRG2CON1_RG2FPOL_MASK                              0x2
#define _PRG2CON1_RG2RDY_POSN                               0x2
#define _PRG2CON1_RG2RDY_POSITION                           0x2
#define _PRG2CON1_RG2RDY_SIZE                               0x1
#define _PRG2CON1_RG2RDY_LENGTH                             0x1
#define _PRG2CON1_RG2RDY_MASK                               0x4

// Register: PRG2CON2
#define PRG2CON2 PRG2CON2
extern volatile unsigned char           PRG2CON2            __at(0x79F);
#ifndef _LIB_BUILD
asm("PRG2CON2 equ 079Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ISET                   :5;
        unsigned                        :2;
        unsigned LR                     :1;
    };
    struct {
        unsigned ISET0                  :1;
        unsigned ISET1                  :1;
        unsigned ISET2                  :1;
        unsigned ISET3                  :1;
        unsigned ISET4                  :1;
    };
    struct {
        unsigned RG2ISET                :5;
    };
    struct {
        unsigned RG2ISET0               :1;
        unsigned RG2ISET1               :1;
        unsigned RG2ISET2               :1;
        unsigned RG2ISET3               :1;
        unsigned RG2ISET4               :1;
    };
} PRG2CON2bits_t;
extern volatile PRG2CON2bits_t PRG2CON2bits __at(0x79F);
// bitfield macros
#define _PRG2CON2_ISET_POSN                                 0x0
#define _PRG2CON2_ISET_POSITION                             0x0
#define _PRG2CON2_ISET_SIZE                                 0x5
#define _PRG2CON2_ISET_LENGTH                               0x5
#define _PRG2CON2_ISET_MASK                                 0x1F
#define _PRG2CON2_LR_POSN                                   0x7
#define _PRG2CON2_LR_POSITION                               0x7
#define _PRG2CON2_LR_SIZE                                   0x1
#define _PRG2CON2_LR_LENGTH                                 0x1
#define _PRG2CON2_LR_MASK                                   0x80
#define _PRG2CON2_ISET0_POSN                                0x0
#define _PRG2CON2_ISET0_POSITION                            0x0
#define _PRG2CON2_ISET0_SIZE                                0x1
#define _PRG2CON2_ISET0_LENGTH                              0x1
#define _PRG2CON2_ISET0_MASK                                0x1
#define _PRG2CON2_ISET1_POSN                                0x1
#define _PRG2CON2_ISET1_POSITION                            0x1
#define _PRG2CON2_ISET1_SIZE                                0x1
#define _PRG2CON2_ISET1_LENGTH                              0x1
#define _PRG2CON2_ISET1_MASK                                0x2
#define _PRG2CON2_ISET2_POSN                                0x2
#define _PRG2CON2_ISET2_POSITION                            0x2
#define _PRG2CON2_ISET2_SIZE                                0x1
#define _PRG2CON2_ISET2_LENGTH                              0x1
#define _PRG2CON2_ISET2_MASK                                0x4
#define _PRG2CON2_ISET3_POSN                                0x3
#define _PRG2CON2_ISET3_POSITION                            0x3
#define _PRG2CON2_ISET3_SIZE                                0x1
#define _PRG2CON2_ISET3_LENGTH                              0x1
#define _PRG2CON2_ISET3_MASK                                0x8
#define _PRG2CON2_ISET4_POSN                                0x4
#define _PRG2CON2_ISET4_POSITION                            0x4
#define _PRG2CON2_ISET4_SIZE                                0x1
#define _PRG2CON2_ISET4_LENGTH                              0x1
#define _PRG2CON2_ISET4_MASK                                0x10
#define _PRG2CON2_RG2ISET_POSN                              0x0
#define _PRG2CON2_RG2ISET_POSITION                          0x0
#define _PRG2CON2_RG2ISET_SIZE                              0x5
#define _PRG2CON2_RG2ISET_LENGTH                            0x5
#define _PRG2CON2_RG2ISET_MASK                              0x1F
#define _PRG2CON2_RG2ISET0_POSN                             0x0
#define _PRG2CON2_RG2ISET0_POSITION                         0x0
#define _PRG2CON2_RG2ISET0_SIZE                             0x1
#define _PRG2CON2_RG2ISET0_LENGTH                           0x1
#define _PRG2CON2_RG2ISET0_MASK                             0x1
#define _PRG2CON2_RG2ISET1_POSN                             0x1
#define _PRG2CON2_RG2ISET1_POSITION                         0x1
#define _PRG2CON2_RG2ISET1_SIZE                             0x1
#define _PRG2CON2_RG2ISET1_LENGTH                           0x1
#define _PRG2CON2_RG2ISET1_MASK                             0x2
#define _PRG2CON2_RG2ISET2_POSN                             0x2
#define _PRG2CON2_RG2ISET2_POSITION                         0x2
#define _PRG2CON2_RG2ISET2_SIZE                             0x1
#define _PRG2CON2_RG2ISET2_LENGTH                           0x1
#define _PRG2CON2_RG2ISET2_MASK                             0x4
#define _PRG2CON2_RG2ISET3_POSN                             0x3
#define _PRG2CON2_RG2ISET3_POSITION                         0x3
#define _PRG2CON2_RG2ISET3_SIZE                             0x1
#define _PRG2CON2_RG2ISET3_LENGTH                           0x1
#define _PRG2CON2_RG2ISET3_MASK                             0x8
#define _PRG2CON2_RG2ISET4_POSN                             0x4
#define _PRG2CON2_RG2ISET4_POSITION                         0x4
#define _PRG2CON2_RG2ISET4_SIZE                             0x1
#define _PRG2CON2_RG2ISET4_LENGTH                           0x1
#define _PRG2CON2_RG2ISET4_MASK                             0x10

// Register: PWMEN
#define PWMEN PWMEN
extern volatile unsigned char           PWMEN               __at(0xD8E);
#ifndef _LIB_BUILD
asm("PWMEN equ 0D8Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned MPWM5EN                :1;
        unsigned MPWM6EN                :1;
    };
} PWMENbits_t;
extern volatile PWMENbits_t PWMENbits __at(0xD8E);
// bitfield macros
#define _PWMEN_MPWM5EN_POSN                                 0x4
#define _PWMEN_MPWM5EN_POSITION                             0x4
#define _PWMEN_MPWM5EN_SIZE                                 0x1
#define _PWMEN_MPWM5EN_LENGTH                               0x1
#define _PWMEN_MPWM5EN_MASK                                 0x10
#define _PWMEN_MPWM6EN_POSN                                 0x5
#define _PWMEN_MPWM6EN_POSITION                             0x5
#define _PWMEN_MPWM6EN_SIZE                                 0x1
#define _PWMEN_MPWM6EN_LENGTH                               0x1
#define _PWMEN_MPWM6EN_MASK                                 0x20

