MikroElektronika/core_packages/PIC/XC8/def/PIC16F1769/mcu.h
extern volatile PWM6INTFbits_t PWM6INTFbits __at(0xDAD);
// bitfield macros
#define _PWM6INTF_PRIF_POSN                                 0x0
#define _PWM6INTF_PRIF_POSITION                             0x0
#define _PWM6INTF_PRIF_SIZE                                 0x1
#define _PWM6INTF_PRIF_LENGTH                               0x1
#define _PWM6INTF_PRIF_MASK                                 0x1
#define _PWM6INTF_DCIF_POSN                                 0x1
#define _PWM6INTF_DCIF_POSITION                             0x1
#define _PWM6INTF_DCIF_SIZE                                 0x1
#define _PWM6INTF_DCIF_LENGTH                               0x1
#define _PWM6INTF_DCIF_MASK                                 0x2
#define _PWM6INTF_PHIF_POSN                                 0x2
#define _PWM6INTF_PHIF_POSITION                             0x2
#define _PWM6INTF_PHIF_SIZE                                 0x1
#define _PWM6INTF_PHIF_LENGTH                               0x1
#define _PWM6INTF_PHIF_MASK                                 0x4
#define _PWM6INTF_OFIF_POSN                                 0x3
#define _PWM6INTF_OFIF_POSITION                             0x3
#define _PWM6INTF_OFIF_SIZE                                 0x1
#define _PWM6INTF_OFIF_LENGTH                               0x1
#define _PWM6INTF_OFIF_MASK                                 0x8
#define _PWM6INTF_PWM6PRIF_POSN                             0x0
#define _PWM6INTF_PWM6PRIF_POSITION                         0x0
#define _PWM6INTF_PWM6PRIF_SIZE                             0x1
#define _PWM6INTF_PWM6PRIF_LENGTH                           0x1
#define _PWM6INTF_PWM6PRIF_MASK                             0x1
#define _PWM6INTF_PWM6DCIF_POSN                             0x1
#define _PWM6INTF_PWM6DCIF_POSITION                         0x1
#define _PWM6INTF_PWM6DCIF_SIZE                             0x1
#define _PWM6INTF_PWM6DCIF_LENGTH                           0x1
#define _PWM6INTF_PWM6DCIF_MASK                             0x2
#define _PWM6INTF_PWM6PHIF_POSN                             0x2
#define _PWM6INTF_PWM6PHIF_POSITION                         0x2
#define _PWM6INTF_PWM6PHIF_SIZE                             0x1
#define _PWM6INTF_PWM6PHIF_LENGTH                           0x1
#define _PWM6INTF_PWM6PHIF_MASK                             0x4
#define _PWM6INTF_PWM6OFIF_POSN                             0x3
#define _PWM6INTF_PWM6OFIF_POSITION                         0x3
#define _PWM6INTF_PWM6OFIF_SIZE                             0x1
#define _PWM6INTF_PWM6OFIF_LENGTH                           0x1
#define _PWM6INTF_PWM6OFIF_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM6PRIF               :1;
        unsigned PWM6DCIF               :1;
        unsigned PWM6PHIF               :1;
        unsigned PWM6OFIF               :1;
    };
} PWM6INTFLGbits_t;
extern volatile PWM6INTFLGbits_t PWM6INTFLGbits __at(0xDAD);
// bitfield macros
#define _PWM6INTFLG_PRIF_POSN                               0x0
#define _PWM6INTFLG_PRIF_POSITION                           0x0
#define _PWM6INTFLG_PRIF_SIZE                               0x1
#define _PWM6INTFLG_PRIF_LENGTH                             0x1
#define _PWM6INTFLG_PRIF_MASK                               0x1
#define _PWM6INTFLG_DCIF_POSN                               0x1
#define _PWM6INTFLG_DCIF_POSITION                           0x1
#define _PWM6INTFLG_DCIF_SIZE                               0x1
#define _PWM6INTFLG_DCIF_LENGTH                             0x1
#define _PWM6INTFLG_DCIF_MASK                               0x2
#define _PWM6INTFLG_PHIF_POSN                               0x2
#define _PWM6INTFLG_PHIF_POSITION                           0x2
#define _PWM6INTFLG_PHIF_SIZE                               0x1
#define _PWM6INTFLG_PHIF_LENGTH                             0x1
#define _PWM6INTFLG_PHIF_MASK                               0x4
#define _PWM6INTFLG_OFIF_POSN                               0x3
#define _PWM6INTFLG_OFIF_POSITION                           0x3
#define _PWM6INTFLG_OFIF_SIZE                               0x1
#define _PWM6INTFLG_OFIF_LENGTH                             0x1
#define _PWM6INTFLG_OFIF_MASK                               0x8
#define _PWM6INTFLG_PWM6PRIF_POSN                           0x0
#define _PWM6INTFLG_PWM6PRIF_POSITION                       0x0
#define _PWM6INTFLG_PWM6PRIF_SIZE                           0x1
#define _PWM6INTFLG_PWM6PRIF_LENGTH                         0x1
#define _PWM6INTFLG_PWM6PRIF_MASK                           0x1
#define _PWM6INTFLG_PWM6DCIF_POSN                           0x1
#define _PWM6INTFLG_PWM6DCIF_POSITION                       0x1
#define _PWM6INTFLG_PWM6DCIF_SIZE                           0x1
#define _PWM6INTFLG_PWM6DCIF_LENGTH                         0x1
#define _PWM6INTFLG_PWM6DCIF_MASK                           0x2
#define _PWM6INTFLG_PWM6PHIF_POSN                           0x2
#define _PWM6INTFLG_PWM6PHIF_POSITION                       0x2
#define _PWM6INTFLG_PWM6PHIF_SIZE                           0x1
#define _PWM6INTFLG_PWM6PHIF_LENGTH                         0x1
#define _PWM6INTFLG_PWM6PHIF_MASK                           0x4
#define _PWM6INTFLG_PWM6OFIF_POSN                           0x3
#define _PWM6INTFLG_PWM6OFIF_POSITION                       0x3
#define _PWM6INTFLG_PWM6OFIF_SIZE                           0x1
#define _PWM6INTFLG_PWM6OFIF_LENGTH                         0x1
#define _PWM6INTFLG_PWM6OFIF_MASK                           0x8

// Register: PWM6CLKCON
#define PWM6CLKCON PWM6CLKCON
extern volatile unsigned char           PWM6CLKCON          __at(0xDAE);
#ifndef _LIB_BUILD
asm("PWM6CLKCON equ 0DAEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :2;
        unsigned                        :2;
        unsigned PS                     :3;
    };
    struct {
        unsigned PWM6CS0                :1;
        unsigned PWM6CS1                :1;
        unsigned PWM6CS2                :1;
        unsigned                        :1;
        unsigned PWM6PS0                :1;
        unsigned PWM6PS1                :1;
        unsigned PWM6PS2                :1;
    };
    struct {
        unsigned PWM6CS                 :3;
        unsigned                        :1;
        unsigned PWM6PS                 :3;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned                        :1;
        unsigned _PS0                    :1;  // Note: Changed by MikroE
        unsigned _PS1                    :1;  // Note: Changed by MikroE
        unsigned _PS2                    :1;  // Note: Changed by MikroE
    };
} PWM6CLKCONbits_t;
