MikroElektronika/core_packages/PIC/XC8/def/PIC16F1769/mcu.h
extern volatile PRG2RPPSbits_t PRG2RPPSbits __at(0xE2E);
// bitfield macros
#define _PRG2RPPS_PRG2RPPS_POSN                             0x0
#define _PRG2RPPS_PRG2RPPS_POSITION                         0x0
#define _PRG2RPPS_PRG2RPPS_SIZE                             0x5
#define _PRG2RPPS_PRG2RPPS_LENGTH                           0x5
#define _PRG2RPPS_PRG2RPPS_MASK                             0x1F

// Register: PRG2FPPS
#define PRG2FPPS PRG2FPPS
extern volatile unsigned char           PRG2FPPS            __at(0xE2F);
#ifndef _LIB_BUILD
asm("PRG2FPPS equ 0E2Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRG2FPPS               :5;
    };
} PRG2FPPSbits_t;
extern volatile PRG2FPPSbits_t PRG2FPPSbits __at(0xE2F);
// bitfield macros
#define _PRG2FPPS_PRG2FPPS_POSN                             0x0
#define _PRG2FPPS_PRG2FPPS_POSITION                         0x0
#define _PRG2FPPS_PRG2FPPS_SIZE                             0x5
#define _PRG2FPPS_PRG2FPPS_LENGTH                           0x5
#define _PRG2FPPS_PRG2FPPS_MASK                             0x1F

// Register: MD1CHPPS
#define MD1CHPPS MD1CHPPS
extern volatile unsigned char           MD1CHPPS            __at(0xE30);
#ifndef _LIB_BUILD
asm("MD1CHPPS equ 0E30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD1CHPPS               :5;
    };
} MD1CHPPSbits_t;
extern volatile MD1CHPPSbits_t MD1CHPPSbits __at(0xE30);
// bitfield macros
#define _MD1CHPPS_MD1CHPPS_POSN                             0x0
#define _MD1CHPPS_MD1CHPPS_POSITION                         0x0
#define _MD1CHPPS_MD1CHPPS_SIZE                             0x5
#define _MD1CHPPS_MD1CHPPS_LENGTH                           0x5
#define _MD1CHPPS_MD1CHPPS_MASK                             0x1F

// Register: MD1CLPPS
#define MD1CLPPS MD1CLPPS
extern volatile unsigned char           MD1CLPPS            __at(0xE31);
#ifndef _LIB_BUILD
asm("MD1CLPPS equ 0E31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD1CLPPS               :5;
    };
} MD1CLPPSbits_t;
extern volatile MD1CLPPSbits_t MD1CLPPSbits __at(0xE31);
// bitfield macros
#define _MD1CLPPS_MD1CLPPS_POSN                             0x0
#define _MD1CLPPS_MD1CLPPS_POSITION                         0x0
#define _MD1CLPPS_MD1CLPPS_SIZE                             0x5
#define _MD1CLPPS_MD1CLPPS_LENGTH                           0x5
#define _MD1CLPPS_MD1CLPPS_MASK                             0x1F

// Register: MD1MODPPS
#define MD1MODPPS MD1MODPPS
extern volatile unsigned char           MD1MODPPS           __at(0xE32);
#ifndef _LIB_BUILD
asm("MD1MODPPS equ 0E32h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD1MODPPS              :5;
    };
} MD1MODPPSbits_t;
extern volatile MD1MODPPSbits_t MD1MODPPSbits __at(0xE32);
// bitfield macros
#define _MD1MODPPS_MD1MODPPS_POSN                           0x0
#define _MD1MODPPS_MD1MODPPS_POSITION                       0x0
#define _MD1MODPPS_MD1MODPPS_SIZE                           0x5
#define _MD1MODPPS_MD1MODPPS_LENGTH                         0x5
#define _MD1MODPPS_MD1MODPPS_MASK                           0x1F

// Register: MD2CHPPS
#define MD2CHPPS MD2CHPPS
extern volatile unsigned char           MD2CHPPS            __at(0xE33);
#ifndef _LIB_BUILD
asm("MD2CHPPS equ 0E33h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD2CHPPS               :5;
    };
} MD2CHPPSbits_t;
extern volatile MD2CHPPSbits_t MD2CHPPSbits __at(0xE33);
// bitfield macros
#define _MD2CHPPS_MD2CHPPS_POSN                             0x0
#define _MD2CHPPS_MD2CHPPS_POSITION                         0x0
#define _MD2CHPPS_MD2CHPPS_SIZE                             0x5
#define _MD2CHPPS_MD2CHPPS_LENGTH                           0x5
#define _MD2CHPPS_MD2CHPPS_MASK                             0x1F

// Register: MD2CLPPS
#define MD2CLPPS MD2CLPPS
extern volatile unsigned char           MD2CLPPS            __at(0xE34);
#ifndef _LIB_BUILD
asm("MD2CLPPS equ 0E34h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD2CLPPS               :5;
    };
} MD2CLPPSbits_t;
extern volatile MD2CLPPSbits_t MD2CLPPSbits __at(0xE34);
// bitfield macros
#define _MD2CLPPS_MD2CLPPS_POSN                             0x0
#define _MD2CLPPS_MD2CLPPS_POSITION                         0x0
#define _MD2CLPPS_MD2CLPPS_SIZE                             0x5
#define _MD2CLPPS_MD2CLPPS_LENGTH                           0x5
#define _MD2CLPPS_MD2CLPPS_MASK                             0x1F

// Register: MD2MODPPS
#define MD2MODPPS MD2MODPPS
extern volatile unsigned char           MD2MODPPS           __at(0xE35);
#ifndef _LIB_BUILD
asm("MD2MODPPS equ 0E35h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD2MODPPS              :5;
    };
} MD2MODPPSbits_t;
extern volatile MD2MODPPSbits_t MD2MODPPSbits __at(0xE35);
// bitfield macros
#define _MD2MODPPS_MD2MODPPS_POSN                           0x0
#define _MD2MODPPS_MD2MODPPS_POSITION                       0x0
#define _MD2MODPPS_MD2MODPPS_SIZE                           0x5
#define _MD2MODPPS_MD2MODPPS_LENGTH                         0x5
#define _MD2MODPPS_MD2MODPPS_MASK                           0x1F

// Register: RA0PPS
#define RA0PPS RA0PPS
extern volatile unsigned char           RA0PPS              __at(0xE90);
#ifndef _LIB_BUILD
asm("RA0PPS equ 0E90h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0PPS                 :5;
    };
} RA0PPSbits_t;
extern volatile RA0PPSbits_t RA0PPSbits __at(0xE90);
// bitfield macros
#define _RA0PPS_RA0PPS_POSN                                 0x0
#define _RA0PPS_RA0PPS_POSITION                             0x0
#define _RA0PPS_RA0PPS_SIZE                                 0x5
#define _RA0PPS_RA0PPS_LENGTH                               0x5
#define _RA0PPS_RA0PPS_MASK                                 0x1F

// Register: RA1PPS
#define RA1PPS RA1PPS
extern volatile unsigned char           RA1PPS              __at(0xE91);
#ifndef _LIB_BUILD
asm("RA1PPS equ 0E91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA1PPS                 :5;
    };
} RA1PPSbits_t;
