MikroElektronika/core_packages/PIC/XC8/def/PIC16F1769/mcu.h
#define                                 DAC2R8_bit          _BIT_ACCESS(DAC2REFH,0)
// DAC2REFH<DAC2R9>
extern volatile __bit                   DAC2R9              __at(0x2CB1);	// @ (0x596 * 8 + 1)
#define                                 DAC2R9_bit          _BIT_ACCESS(DAC2REFH,1)
// DAC2REFL<DAC2REF0>
extern volatile __bit                   DAC2REF0            __at(0x2CA8);	// @ (0x595 * 8 + 0)
#define                                 DAC2REF0_bit        _BIT_ACCESS(DAC2REFL,0)
// DAC2REFL<DAC2REF1>
extern volatile __bit                   DAC2REF1            __at(0x2CA9);	// @ (0x595 * 8 + 1)
#define                                 DAC2REF1_bit        _BIT_ACCESS(DAC2REFL,1)
// DAC2REFH<DAC2REF10>
extern volatile __bit                   DAC2REF10           __at(0x2CB2);	// @ (0x596 * 8 + 2)
#define                                 DAC2REF10_bit       _BIT_ACCESS(DAC2REFH,2)
// DAC2REFH<DAC2REF11>
extern volatile __bit                   DAC2REF11           __at(0x2CB3);	// @ (0x596 * 8 + 3)
#define                                 DAC2REF11_bit       _BIT_ACCESS(DAC2REFH,3)
// DAC2REFH<DAC2REF12>
extern volatile __bit                   DAC2REF12           __at(0x2CB4);	// @ (0x596 * 8 + 4)
#define                                 DAC2REF12_bit       _BIT_ACCESS(DAC2REFH,4)
// DAC2REFH<DAC2REF13>
extern volatile __bit                   DAC2REF13           __at(0x2CB5);	// @ (0x596 * 8 + 5)
#define                                 DAC2REF13_bit       _BIT_ACCESS(DAC2REFH,5)
// DAC2REFH<DAC2REF14>
extern volatile __bit                   DAC2REF14           __at(0x2CB6);	// @ (0x596 * 8 + 6)
#define                                 DAC2REF14_bit       _BIT_ACCESS(DAC2REFH,6)
// DAC2REFH<DAC2REF15>
extern volatile __bit                   DAC2REF15           __at(0x2CB7);	// @ (0x596 * 8 + 7)
#define                                 DAC2REF15_bit       _BIT_ACCESS(DAC2REFH,7)
// DAC2REFL<DAC2REF2>
extern volatile __bit                   DAC2REF2            __at(0x2CAA);	// @ (0x595 * 8 + 2)
#define                                 DAC2REF2_bit        _BIT_ACCESS(DAC2REFL,2)
// DAC2REFL<DAC2REF3>
extern volatile __bit                   DAC2REF3            __at(0x2CAB);	// @ (0x595 * 8 + 3)
#define                                 DAC2REF3_bit        _BIT_ACCESS(DAC2REFL,3)
// DAC2REFL<DAC2REF4>
extern volatile __bit                   DAC2REF4            __at(0x2CAC);	// @ (0x595 * 8 + 4)
#define                                 DAC2REF4_bit        _BIT_ACCESS(DAC2REFL,4)
// DAC2REFL<DAC2REF5>
extern volatile __bit                   DAC2REF5            __at(0x2CAD);	// @ (0x595 * 8 + 5)
#define                                 DAC2REF5_bit        _BIT_ACCESS(DAC2REFL,5)
// DAC2REFL<DAC2REF6>
extern volatile __bit                   DAC2REF6            __at(0x2CAE);	// @ (0x595 * 8 + 6)
#define                                 DAC2REF6_bit        _BIT_ACCESS(DAC2REFL,6)
// DAC2REFL<DAC2REF7>
extern volatile __bit                   DAC2REF7            __at(0x2CAF);	// @ (0x595 * 8 + 7)
#define                                 DAC2REF7_bit        _BIT_ACCESS(DAC2REFL,7)
// DAC2REFH<DAC2REF8>
extern volatile __bit                   DAC2REF8            __at(0x2CB0);	// @ (0x596 * 8 + 0)
#define                                 DAC2REF8_bit        _BIT_ACCESS(DAC2REFH,0)
// DAC2REFH<DAC2REF9>
extern volatile __bit                   DAC2REF9            __at(0x2CB1);	// @ (0x596 * 8 + 1)
#define                                 DAC2REF9_bit        _BIT_ACCESS(DAC2REFH,1)
// DAC3CON0<DAC3EN>
extern volatile __bit                   DAC3EN              __at(0x2CBF);	// @ (0x597 * 8 + 7)
#define                                 DAC3EN_bit          _BIT_ACCESS(DAC3CON0,7)
// DAC3CON0<DAC3NSS>
extern volatile __bit                   DAC3NSS             __at(0x2CB8);	// @ (0x597 * 8 + 0)
#define                                 DAC3NSS_bit         _BIT_ACCESS(DAC3CON0,0)
// DAC3CON0<DAC3OE1>
extern volatile __bit                   DAC3OE1             __at(0x2CBD);	// @ (0x597 * 8 + 5)
#define                                 DAC3OE1_bit         _BIT_ACCESS(DAC3CON0,5)
// DAC3CON0<DAC3PSS0>
extern volatile __bit                   DAC3PSS0            __at(0x2CBA);	// @ (0x597 * 8 + 2)
#define                                 DAC3PSS0_bit        _BIT_ACCESS(DAC3CON0,2)
// DAC3CON0<DAC3PSS1>
extern volatile __bit                   DAC3PSS1            __at(0x2CBB);	// @ (0x597 * 8 + 3)
#define                                 DAC3PSS1_bit        _BIT_ACCESS(DAC3CON0,3)
// DAC3REF<DAC3R0>
extern volatile __bit                   DAC3R0              __at(0x2CC0);	// @ (0x598 * 8 + 0)
#define                                 DAC3R0_bit          _BIT_ACCESS(DAC3REF,0)
// DAC3REF<DAC3R1>
extern volatile __bit                   DAC3R1              __at(0x2CC1);	// @ (0x598 * 8 + 1)
#define                                 DAC3R1_bit          _BIT_ACCESS(DAC3REF,1)
// DAC3REF<DAC3R2>
extern volatile __bit                   DAC3R2              __at(0x2CC2);	// @ (0x598 * 8 + 2)
#define                                 DAC3R2_bit          _BIT_ACCESS(DAC3REF,2)
// DAC3REF<DAC3R3>
extern volatile __bit                   DAC3R3              __at(0x2CC3);	// @ (0x598 * 8 + 3)
#define                                 DAC3R3_bit          _BIT_ACCESS(DAC3REF,3)
// DAC3REF<DAC3R4>
extern volatile __bit                   DAC3R4              __at(0x2CC4);	// @ (0x598 * 8 + 4)
#define                                 DAC3R4_bit          _BIT_ACCESS(DAC3REF,4)
// DAC3REF<DAC3REF0>
extern volatile __bit                   DAC3REF0            __at(0x2CC0);	// @ (0x598 * 8 + 0)
#define                                 DAC3REF0_bit        _BIT_ACCESS(DAC3REF,0)
// DAC3REF<DAC3REF1>
extern volatile __bit                   DAC3REF1            __at(0x2CC1);	// @ (0x598 * 8 + 1)
#define                                 DAC3REF1_bit        _BIT_ACCESS(DAC3REF,1)
// DAC3REF<DAC3REF2>
extern volatile __bit                   DAC3REF2            __at(0x2CC2);	// @ (0x598 * 8 + 2)
#define                                 DAC3REF2_bit        _BIT_ACCESS(DAC3REF,2)
// DAC3REF<DAC3REF3>
extern volatile __bit                   DAC3REF3            __at(0x2CC3);	// @ (0x598 * 8 + 3)
#define                                 DAC3REF3_bit        _BIT_ACCESS(DAC3REF,3)
// DAC3REF<DAC3REF4>
extern volatile __bit                   DAC3REF4            __at(0x2CC4);	// @ (0x598 * 8 + 4)
#define                                 DAC3REF4_bit        _BIT_ACCESS(DAC3REF,4)
// DAC3REF<DAC3REF5>
extern volatile __bit                   DAC3REF5            __at(0x2CC5);	// @ (0x598 * 8 + 5)
#define                                 DAC3REF5_bit        _BIT_ACCESS(DAC3REF,5)
// DAC4CON0<DAC4EN>
extern volatile __bit                   DAC4EN              __at(0x2CCF);	// @ (0x599 * 8 + 7)
#define                                 DAC4EN_bit          _BIT_ACCESS(DAC4CON0,7)
// DAC4CON0<DAC4NSS>
extern volatile __bit                   DAC4NSS             __at(0x2CC8);	// @ (0x599 * 8 + 0)
#define                                 DAC4NSS_bit         _BIT_ACCESS(DAC4CON0,0)
// DAC4CON0<DAC4OE1>
extern volatile __bit                   DAC4OE1             __at(0x2CCD);	// @ (0x599 * 8 + 5)
#define                                 DAC4OE1_bit         _BIT_ACCESS(DAC4CON0,5)
// DAC4CON0<DAC4PSS0>
extern volatile __bit                   DAC4PSS0            __at(0x2CCA);	// @ (0x599 * 8 + 2)
#define                                 DAC4PSS0_bit        _BIT_ACCESS(DAC4CON0,2)
// DAC4CON0<DAC4PSS1>
extern volatile __bit                   DAC4PSS1            __at(0x2CCB);	// @ (0x599 * 8 + 3)
#define                                 DAC4PSS1_bit        _BIT_ACCESS(DAC4CON0,3)
// DAC4REF<DAC4R0>
extern volatile __bit                   DAC4R0              __at(0x2CD0);	// @ (0x59A * 8 + 0)
#define                                 DAC4R0_bit          _BIT_ACCESS(DAC4REF,0)
// DAC4REF<DAC4R1>
extern volatile __bit                   DAC4R1              __at(0x2CD1);	// @ (0x59A * 8 + 1)
#define                                 DAC4R1_bit          _BIT_ACCESS(DAC4REF,1)
// DAC4REF<DAC4R2>
extern volatile __bit                   DAC4R2              __at(0x2CD2);	// @ (0x59A * 8 + 2)
#define                                 DAC4R2_bit          _BIT_ACCESS(DAC4REF,2)
// DAC4REF<DAC4R3>
extern volatile __bit                   DAC4R3              __at(0x2CD3);	// @ (0x59A * 8 + 3)
#define                                 DAC4R3_bit          _BIT_ACCESS(DAC4REF,3)
// DAC4REF<DAC4R4>
extern volatile __bit                   DAC4R4              __at(0x2CD4);	// @ (0x59A * 8 + 4)
#define                                 DAC4R4_bit          _BIT_ACCESS(DAC4REF,4)
// DAC4REF<DAC4REF0>
extern volatile __bit                   DAC4REF0            __at(0x2CD0);	// @ (0x59A * 8 + 0)
#define                                 DAC4REF0_bit        _BIT_ACCESS(DAC4REF,0)
// DAC4REF<DAC4REF1>
extern volatile __bit                   DAC4REF1            __at(0x2CD1);	// @ (0x59A * 8 + 1)
#define                                 DAC4REF1_bit        _BIT_ACCESS(DAC4REF,1)
// DAC4REF<DAC4REF2>
extern volatile __bit                   DAC4REF2            __at(0x2CD2);	// @ (0x59A * 8 + 2)
#define                                 DAC4REF2_bit        _BIT_ACCESS(DAC4REF,2)
// DAC4REF<DAC4REF3>
extern volatile __bit                   DAC4REF3            __at(0x2CD3);	// @ (0x59A * 8 + 3)
#define                                 DAC4REF3_bit        _BIT_ACCESS(DAC4REF,3)
// DAC4REF<DAC4REF4>
extern volatile __bit                   DAC4REF4            __at(0x2CD4);	// @ (0x59A * 8 + 4)
#define                                 DAC4REF4_bit        _BIT_ACCESS(DAC4REF,4)
// DAC4REF<DAC4REF5>
extern volatile __bit                   DAC4REF5            __at(0x2CD5);	// @ (0x59A * 8 + 5)
#define                                 DAC4REF5_bit        _BIT_ACCESS(DAC4REF,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// STATUS_SHAD<DC_SHAD>
extern volatile __bit                   DC_SHAD             __at(0x7F21);	// @ (0xFE4 * 8 + 1)
#define                                 DC_SHAD_bit         _BIT_ACCESS(STATUS_SHAD,1)
// SSP1CON3<DHEN>
extern volatile __bit                   DHEN                __at(0x10B8);	// @ (0x217 * 8 + 0)
#define                                 DHEN_bit            _BIT_ACCESS(SSP1CON3,0)
// SSP1STAT<D_nA>
extern volatile __bit                   D_nA                __at(0x10A5);	// @ (0x214 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSP1STAT,5)
// RC1STA<FERR>
extern volatile __bit                   FERR                __at(0xCEA);	// @ (0x19D * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RC1STA,2)
// PMCON1<FREE>
extern volatile __bit                   FREE                __at(0xCAC);	// @ (0x195 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(PMCON1,4)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x10F7);	// @ (0x21E * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x10F6);	// @ (0x21E * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// COG1ASD0<G1ARSEN>
extern volatile __bit                   G1ARSEN             __at(0x34EE);	// @ (0x69D * 8 + 6)
#define                                 G1ARSEN_bit         _BIT_ACCESS(COG1ASD0,6)
// COG1ASD1<G1AS0E>
extern volatile __bit                   G1AS0E              __at(0x34F0);	// @ (0x69E * 8 + 0)
#define                                 G1AS0E_bit          _BIT_ACCESS(COG1ASD1,0)
// COG1ASD1<G1AS1E>
extern volatile __bit                   G1AS1E              __at(0x34F1);	// @ (0x69E * 8 + 1)
#define                                 G1AS1E_bit          _BIT_ACCESS(COG1ASD1,1)
// COG1ASD1<G1AS2E>
extern volatile __bit                   G1AS2E              __at(0x34F2);	// @ (0x69E * 8 + 2)
#define                                 G1AS2E_bit          _BIT_ACCESS(COG1ASD1,2)
// COG1ASD1<G1AS3E>
extern volatile __bit                   G1AS3E              __at(0x34F3);	// @ (0x69E * 8 + 3)
#define                                 G1AS3E_bit          _BIT_ACCESS(COG1ASD1,3)
// COG1ASD1<G1AS4E>
extern volatile __bit                   G1AS4E              __at(0x34F4);	// @ (0x69E * 8 + 4)
#define                                 G1AS4E_bit          _BIT_ACCESS(COG1ASD1,4)
// COG1ASD1<G1AS5E>
extern volatile __bit                   G1AS5E              __at(0x34F5);	// @ (0x69E * 8 + 5)
#define                                 G1AS5E_bit          _BIT_ACCESS(COG1ASD1,5)
// COG1ASD1<G1AS6E>
extern volatile __bit                   G1AS6E              __at(0x34F6);	// @ (0x69E * 8 + 6)
#define                                 G1AS6E_bit          _BIT_ACCESS(COG1ASD1,6)
// COG1ASD1<G1AS7E>
extern volatile __bit                   G1AS7E              __at(0x34F7);	// @ (0x69E * 8 + 7)
#define                                 G1AS7E_bit          _BIT_ACCESS(COG1ASD1,7)
// COG1ASD0<G1ASDAC0>
extern volatile __bit                   G1ASDAC0            __at(0x34EA);	// @ (0x69D * 8 + 2)
#define                                 G1ASDAC0_bit        _BIT_ACCESS(COG1ASD0,2)
// COG1ASD0<G1ASDAC1>
extern volatile __bit                   G1ASDAC1            __at(0x34EB);	// @ (0x69D * 8 + 3)
#define                                 G1ASDAC1_bit        _BIT_ACCESS(COG1ASD0,3)
// COG1ASD0<G1ASDBD0>
extern volatile __bit                   G1ASDBD0            __at(0x34EC);	// @ (0x69D * 8 + 4)
#define                                 G1ASDBD0_bit        _BIT_ACCESS(COG1ASD0,4)
// COG1ASD0<G1ASDBD1>
extern volatile __bit                   G1ASDBD1            __at(0x34ED);	// @ (0x69D * 8 + 5)
#define                                 G1ASDBD1_bit        _BIT_ACCESS(COG1ASD0,5)
// COG1ASD0<G1ASE>
extern volatile __bit                   G1ASE               __at(0x34EF);	// @ (0x69D * 8 + 7)
#define                                 G1ASE_bit           _BIT_ACCESS(COG1ASD0,7)
// COG1ASD0<G1ASREN>
extern volatile __bit                   G1ASREN             __at(0x34EE);	// @ (0x69D * 8 + 6)
#define                                 G1ASREN_bit         _BIT_ACCESS(COG1ASD0,6)
// COG1BLKF<G1BLKF0>
extern volatile __bit                   G1BLKF0             __at(0x3480);	// @ (0x690 * 8 + 0)
#define                                 G1BLKF0_bit         _BIT_ACCESS(COG1BLKF,0)
// COG1BLKF<G1BLKF1>
extern volatile __bit                   G1BLKF1             __at(0x3481);	// @ (0x690 * 8 + 1)
#define                                 G1BLKF1_bit         _BIT_ACCESS(COG1BLKF,1)
// COG1BLKF<G1BLKF2>
extern volatile __bit                   G1BLKF2             __at(0x3482);	// @ (0x690 * 8 + 2)
#define                                 G1BLKF2_bit         _BIT_ACCESS(COG1BLKF,2)
// COG1BLKF<G1BLKF3>
extern volatile __bit                   G1BLKF3             __at(0x3483);	// @ (0x690 * 8 + 3)
#define                                 G1BLKF3_bit         _BIT_ACCESS(COG1BLKF,3)
// COG1BLKF<G1BLKF4>
extern volatile __bit                   G1BLKF4             __at(0x3484);	// @ (0x690 * 8 + 4)
#define                                 G1BLKF4_bit         _BIT_ACCESS(COG1BLKF,4)
// COG1BLKF<G1BLKF5>
extern volatile __bit                   G1BLKF5             __at(0x3485);	// @ (0x690 * 8 + 5)
#define                                 G1BLKF5_bit         _BIT_ACCESS(COG1BLKF,5)
// COG1BLKR<G1BLKR0>
extern volatile __bit                   G1BLKR0             __at(0x3478);	// @ (0x68F * 8 + 0)
#define                                 G1BLKR0_bit         _BIT_ACCESS(COG1BLKR,0)
// COG1BLKR<G1BLKR1>
extern volatile __bit                   G1BLKR1             __at(0x3479);	// @ (0x68F * 8 + 1)
#define                                 G1BLKR1_bit         _BIT_ACCESS(COG1BLKR,1)
// COG1BLKR<G1BLKR2>
extern volatile __bit                   G1BLKR2             __at(0x347A);	// @ (0x68F * 8 + 2)
#define                                 G1BLKR2_bit         _BIT_ACCESS(COG1BLKR,2)
// COG1BLKR<G1BLKR3>
extern volatile __bit                   G1BLKR3             __at(0x347B);	// @ (0x68F * 8 + 3)
#define                                 G1BLKR3_bit         _BIT_ACCESS(COG1BLKR,3)
// COG1BLKR<G1BLKR4>
extern volatile __bit                   G1BLKR4             __at(0x347C);	// @ (0x68F * 8 + 4)
#define                                 G1BLKR4_bit         _BIT_ACCESS(COG1BLKR,4)
// COG1BLKR<G1BLKR5>
extern volatile __bit                   G1BLKR5             __at(0x347D);	// @ (0x68F * 8 + 5)
#define                                 G1BLKR5_bit         _BIT_ACCESS(COG1BLKR,5)
// COG1CON0<G1CS0>
extern volatile __bit                   G1CS0               __at(0x349B);	// @ (0x693 * 8 + 3)
#define                                 G1CS0_bit           _BIT_ACCESS(COG1CON0,3)
// COG1CON0<G1CS1>
extern volatile __bit                   G1CS1               __at(0x349C);	// @ (0x693 * 8 + 4)
#define                                 G1CS1_bit           _BIT_ACCESS(COG1CON0,4)
// COG1DBF<G1DBF0>
extern volatile __bit                   G1DBF0              __at(0x3490);	// @ (0x692 * 8 + 0)
#define                                 G1DBF0_bit          _BIT_ACCESS(COG1DBF,0)
// COG1DBF<G1DBF1>
extern volatile __bit                   G1DBF1              __at(0x3491);	// @ (0x692 * 8 + 1)
#define                                 G1DBF1_bit          _BIT_ACCESS(COG1DBF,1)
// COG1DBF<G1DBF2>
extern volatile __bit                   G1DBF2              __at(0x3492);	// @ (0x692 * 8 + 2)
#define                                 G1DBF2_bit          _BIT_ACCESS(COG1DBF,2)
// COG1DBF<G1DBF3>
extern volatile __bit                   G1DBF3              __at(0x3493);	// @ (0x692 * 8 + 3)
#define                                 G1DBF3_bit          _BIT_ACCESS(COG1DBF,3)
// COG1DBF<G1DBF4>
extern volatile __bit                   G1DBF4              __at(0x3494);	// @ (0x692 * 8 + 4)
#define                                 G1DBF4_bit          _BIT_ACCESS(COG1DBF,4)
// COG1DBF<G1DBF5>
extern volatile __bit                   G1DBF5              __at(0x3495);	// @ (0x692 * 8 + 5)
#define                                 G1DBF5_bit          _BIT_ACCESS(COG1DBF,5)
// COG1DBR<G1DBR0>
extern volatile __bit                   G1DBR0              __at(0x3488);	// @ (0x691 * 8 + 0)
#define                                 G1DBR0_bit          _BIT_ACCESS(COG1DBR,0)
// COG1DBR<G1DBR1>
extern volatile __bit                   G1DBR1              __at(0x3489);	// @ (0x691 * 8 + 1)
#define                                 G1DBR1_bit          _BIT_ACCESS(COG1DBR,1)
// COG1DBR<G1DBR2>
extern volatile __bit                   G1DBR2              __at(0x348A);	// @ (0x691 * 8 + 2)
#define                                 G1DBR2_bit          _BIT_ACCESS(COG1DBR,2)
// COG1DBR<G1DBR3>
extern volatile __bit                   G1DBR3              __at(0x348B);	// @ (0x691 * 8 + 3)
#define                                 G1DBR3_bit          _BIT_ACCESS(COG1DBR,3)
// COG1DBR<G1DBR4>
extern volatile __bit                   G1DBR4              __at(0x348C);	// @ (0x691 * 8 + 4)
#define                                 G1DBR4_bit          _BIT_ACCESS(COG1DBR,4)
// COG1DBR<G1DBR5>
extern volatile __bit                   G1DBR5              __at(0x348D);	// @ (0x691 * 8 + 5)
#define                                 G1DBR5_bit          _BIT_ACCESS(COG1DBR,5)
// COG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0x349F);	// @ (0x693 * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(COG1CON0,7)
// COG1CON1<G1FDBS>
extern volatile __bit                   G1FDBS              __at(0x34A6);	// @ (0x694 * 8 + 6)
#define                                 G1FDBS_bit          _BIT_ACCESS(COG1CON1,6)
// COG1FIS0<G1FIS0>
extern volatile __bit                   G1FIS0              __at(0x34C8);	// @ (0x699 * 8 + 0)
#define                                 G1FIS0_bit          _BIT_ACCESS(COG1FIS0,0)
// COG1FIS0<G1FIS1>
extern volatile __bit                   G1FIS1              __at(0x34C9);	// @ (0x699 * 8 + 1)
#define                                 G1FIS1_bit          _BIT_ACCESS(COG1FIS0,1)
// COG1FIS1<G1FIS10>
extern volatile __bit                   G1FIS10             __at(0x34D2);	// @ (0x69A * 8 + 2)
#define                                 G1FIS10_bit         _BIT_ACCESS(COG1FIS1,2)
// COG1FIS1<G1FIS11>
extern volatile __bit                   G1FIS11             __at(0x34D3);	// @ (0x69A * 8 + 3)
#define                                 G1FIS11_bit         _BIT_ACCESS(COG1FIS1,3)
// COG1FIS1<G1FIS12>
extern volatile __bit                   G1FIS12             __at(0x34D4);	// @ (0x69A * 8 + 4)
#define                                 G1FIS12_bit         _BIT_ACCESS(COG1FIS1,4)
// COG1FIS1<G1FIS13>
extern volatile __bit                   G1FIS13             __at(0x34D5);	// @ (0x69A * 8 + 5)
#define                                 G1FIS13_bit         _BIT_ACCESS(COG1FIS1,5)
// COG1FIS1<G1FIS14>
extern volatile __bit                   G1FIS14             __at(0x34D6);	// @ (0x69A * 8 + 6)
#define                                 G1FIS14_bit         _BIT_ACCESS(COG1FIS1,6)
// COG1FIS1<G1FIS15>
extern volatile __bit                   G1FIS15             __at(0x34D7);	// @ (0x69A * 8 + 7)
#define                                 G1FIS15_bit         _BIT_ACCESS(COG1FIS1,7)
// COG1FIS0<G1FIS2>
extern volatile __bit                   G1FIS2              __at(0x34CA);	// @ (0x699 * 8 + 2)
#define                                 G1FIS2_bit          _BIT_ACCESS(COG1FIS0,2)
// COG1FIS0<G1FIS3>
extern volatile __bit                   G1FIS3              __at(0x34CB);	// @ (0x699 * 8 + 3)
#define                                 G1FIS3_bit          _BIT_ACCESS(COG1FIS0,3)
// COG1FIS0<G1FIS4>
extern volatile __bit                   G1FIS4              __at(0x34CC);	// @ (0x699 * 8 + 4)
#define                                 G1FIS4_bit          _BIT_ACCESS(COG1FIS0,4)
// COG1FIS0<G1FIS5>
extern volatile __bit                   G1FIS5              __at(0x34CD);	// @ (0x699 * 8 + 5)
#define                                 G1FIS5_bit          _BIT_ACCESS(COG1FIS0,5)
// COG1FIS0<G1FIS6>
extern volatile __bit                   G1FIS6              __at(0x34CE);	// @ (0x699 * 8 + 6)
#define                                 G1FIS6_bit          _BIT_ACCESS(COG1FIS0,6)
// COG1FIS0<G1FIS7>
extern volatile __bit                   G1FIS7              __at(0x34CF);	// @ (0x699 * 8 + 7)
#define                                 G1FIS7_bit          _BIT_ACCESS(COG1FIS0,7)
// COG1FIS1<G1FIS8>
extern volatile __bit                   G1FIS8              __at(0x34D0);	// @ (0x69A * 8 + 0)
#define                                 G1FIS8_bit          _BIT_ACCESS(COG1FIS1,0)
// COG1FIS1<G1FIS9>
extern volatile __bit                   G1FIS9              __at(0x34D1);	// @ (0x69A * 8 + 1)
#define                                 G1FIS9_bit          _BIT_ACCESS(COG1FIS1,1)
// COG1FSIM0<G1FSIM0>
extern volatile __bit                   G1FSIM0             __at(0x34D8);	// @ (0x69B * 8 + 0)
#define                                 G1FSIM0_bit         _BIT_ACCESS(COG1FSIM0,0)
// COG1FSIM0<G1FSIM1>
extern volatile __bit                   G1FSIM1             __at(0x34D9);	// @ (0x69B * 8 + 1)
#define                                 G1FSIM1_bit         _BIT_ACCESS(COG1FSIM0,1)
// COG1FSIM1<G1FSIM10>
extern volatile __bit                   G1FSIM10            __at(0x34E2);	// @ (0x69C * 8 + 2)
#define                                 G1FSIM10_bit        _BIT_ACCESS(COG1FSIM1,2)
// COG1FSIM1<G1FSIM11>
extern volatile __bit                   G1FSIM11            __at(0x34E3);	// @ (0x69C * 8 + 3)
#define                                 G1FSIM11_bit        _BIT_ACCESS(COG1FSIM1,3)
// COG1FSIM1<G1FSIM12>
