MikroElektronika/core_packages/PIC/XC8/def/PIC16F1769/mcu.h
extern volatile __bit                   G2FIS12             __at(0x38D4);	// @ (0x71A * 8 + 4)
#define                                 G2FIS12_bit         _BIT_ACCESS(COG2FIS1,4)
// COG2FIS1<G2FIS13>
extern volatile __bit                   G2FIS13             __at(0x38D5);	// @ (0x71A * 8 + 5)
#define                                 G2FIS13_bit         _BIT_ACCESS(COG2FIS1,5)
// COG2FIS1<G2FIS14>
extern volatile __bit                   G2FIS14             __at(0x38D6);	// @ (0x71A * 8 + 6)
#define                                 G2FIS14_bit         _BIT_ACCESS(COG2FIS1,6)
// COG2FIS1<G2FIS15>
extern volatile __bit                   G2FIS15             __at(0x38D7);	// @ (0x71A * 8 + 7)
#define                                 G2FIS15_bit         _BIT_ACCESS(COG2FIS1,7)
// COG2FIS0<G2FIS2>
extern volatile __bit                   G2FIS2              __at(0x38CA);	// @ (0x719 * 8 + 2)
#define                                 G2FIS2_bit          _BIT_ACCESS(COG2FIS0,2)
// COG2FIS0<G2FIS3>
extern volatile __bit                   G2FIS3              __at(0x38CB);	// @ (0x719 * 8 + 3)
#define                                 G2FIS3_bit          _BIT_ACCESS(COG2FIS0,3)
// COG2FIS0<G2FIS4>
extern volatile __bit                   G2FIS4              __at(0x38CC);	// @ (0x719 * 8 + 4)
#define                                 G2FIS4_bit          _BIT_ACCESS(COG2FIS0,4)
// COG2FIS0<G2FIS5>
extern volatile __bit                   G2FIS5              __at(0x38CD);	// @ (0x719 * 8 + 5)
#define                                 G2FIS5_bit          _BIT_ACCESS(COG2FIS0,5)
// COG2FIS0<G2FIS6>
extern volatile __bit                   G2FIS6              __at(0x38CE);	// @ (0x719 * 8 + 6)
#define                                 G2FIS6_bit          _BIT_ACCESS(COG2FIS0,6)
// COG2FIS0<G2FIS7>
extern volatile __bit                   G2FIS7              __at(0x38CF);	// @ (0x719 * 8 + 7)
#define                                 G2FIS7_bit          _BIT_ACCESS(COG2FIS0,7)
// COG2FIS1<G2FIS8>
extern volatile __bit                   G2FIS8              __at(0x38D0);	// @ (0x71A * 8 + 0)
#define                                 G2FIS8_bit          _BIT_ACCESS(COG2FIS1,0)
// COG2FIS1<G2FIS9>
extern volatile __bit                   G2FIS9              __at(0x38D1);	// @ (0x71A * 8 + 1)
#define                                 G2FIS9_bit          _BIT_ACCESS(COG2FIS1,1)
// COG2FSIM0<G2FSIM0>
extern volatile __bit                   G2FSIM0             __at(0x38D8);	// @ (0x71B * 8 + 0)
#define                                 G2FSIM0_bit         _BIT_ACCESS(COG2FSIM0,0)
// COG2FSIM0<G2FSIM1>
extern volatile __bit                   G2FSIM1             __at(0x38D9);	// @ (0x71B * 8 + 1)
#define                                 G2FSIM1_bit         _BIT_ACCESS(COG2FSIM0,1)
// COG2FSIM1<G2FSIM10>
extern volatile __bit                   G2FSIM10            __at(0x38E2);	// @ (0x71C * 8 + 2)
#define                                 G2FSIM10_bit        _BIT_ACCESS(COG2FSIM1,2)
// COG2FSIM1<G2FSIM11>
extern volatile __bit                   G2FSIM11            __at(0x38E3);	// @ (0x71C * 8 + 3)
#define                                 G2FSIM11_bit        _BIT_ACCESS(COG2FSIM1,3)
// COG2FSIM1<G2FSIM12>
extern volatile __bit                   G2FSIM12            __at(0x38E4);	// @ (0x71C * 8 + 4)
#define                                 G2FSIM12_bit        _BIT_ACCESS(COG2FSIM1,4)
// COG2FSIM1<G2FSIM13>
extern volatile __bit                   G2FSIM13            __at(0x38E5);	// @ (0x71C * 8 + 5)
#define                                 G2FSIM13_bit        _BIT_ACCESS(COG2FSIM1,5)
// COG2FSIM1<G2FSIM14>
extern volatile __bit                   G2FSIM14            __at(0x38E6);	// @ (0x71C * 8 + 6)
#define                                 G2FSIM14_bit        _BIT_ACCESS(COG2FSIM1,6)
// COG2FSIM1<G2FSIM15>
extern volatile __bit                   G2FSIM15            __at(0x38E7);	// @ (0x71C * 8 + 7)
#define                                 G2FSIM15_bit        _BIT_ACCESS(COG2FSIM1,7)
// COG2FSIM0<G2FSIM2>
extern volatile __bit                   G2FSIM2             __at(0x38DA);	// @ (0x71B * 8 + 2)
#define                                 G2FSIM2_bit         _BIT_ACCESS(COG2FSIM0,2)
// COG2FSIM0<G2FSIM3>
extern volatile __bit                   G2FSIM3             __at(0x38DB);	// @ (0x71B * 8 + 3)
#define                                 G2FSIM3_bit         _BIT_ACCESS(COG2FSIM0,3)
// COG2FSIM0<G2FSIM4>
extern volatile __bit                   G2FSIM4             __at(0x38DC);	// @ (0x71B * 8 + 4)
#define                                 G2FSIM4_bit         _BIT_ACCESS(COG2FSIM0,4)
// COG2FSIM0<G2FSIM5>
extern volatile __bit                   G2FSIM5             __at(0x38DD);	// @ (0x71B * 8 + 5)
#define                                 G2FSIM5_bit         _BIT_ACCESS(COG2FSIM0,5)
// COG2FSIM0<G2FSIM6>
extern volatile __bit                   G2FSIM6             __at(0x38DE);	// @ (0x71B * 8 + 6)
#define                                 G2FSIM6_bit         _BIT_ACCESS(COG2FSIM0,6)
// COG2FSIM0<G2FSIM7>
extern volatile __bit                   G2FSIM7             __at(0x38DF);	// @ (0x71B * 8 + 7)
#define                                 G2FSIM7_bit         _BIT_ACCESS(COG2FSIM0,7)
// COG2FSIM1<G2FSIM8>
extern volatile __bit                   G2FSIM8             __at(0x38E0);	// @ (0x71C * 8 + 0)
#define                                 G2FSIM8_bit         _BIT_ACCESS(COG2FSIM1,0)
// COG2FSIM1<G2FSIM9>
extern volatile __bit                   G2FSIM9             __at(0x38E1);	// @ (0x71C * 8 + 1)
#define                                 G2FSIM9_bit         _BIT_ACCESS(COG2FSIM1,1)
// COG2CON0<G2LD>
extern volatile __bit                   G2LD                __at(0x389E);	// @ (0x713 * 8 + 6)
#define                                 G2LD_bit            _BIT_ACCESS(COG2CON0,6)
// COG2CON0<G2MD0>
extern volatile __bit                   G2MD0               __at(0x3898);	// @ (0x713 * 8 + 0)
#define                                 G2MD0_bit           _BIT_ACCESS(COG2CON0,0)
// COG2CON0<G2MD1>
extern volatile __bit                   G2MD1               __at(0x3899);	// @ (0x713 * 8 + 1)
#define                                 G2MD1_bit           _BIT_ACCESS(COG2CON0,1)
// COG2CON0<G2MD2>
extern volatile __bit                   G2MD2               __at(0x389A);	// @ (0x713 * 8 + 2)
#define                                 G2MD2_bit           _BIT_ACCESS(COG2CON0,2)
// COG2PHF<G2PHF0>
extern volatile __bit                   G2PHF0              __at(0x3870);	// @ (0x70E * 8 + 0)
#define                                 G2PHF0_bit          _BIT_ACCESS(COG2PHF,0)
// COG2PHF<G2PHF1>
extern volatile __bit                   G2PHF1              __at(0x3871);	// @ (0x70E * 8 + 1)
#define                                 G2PHF1_bit          _BIT_ACCESS(COG2PHF,1)
// COG2PHF<G2PHF2>
extern volatile __bit                   G2PHF2              __at(0x3872);	// @ (0x70E * 8 + 2)
#define                                 G2PHF2_bit          _BIT_ACCESS(COG2PHF,2)
// COG2PHF<G2PHF3>
extern volatile __bit                   G2PHF3              __at(0x3873);	// @ (0x70E * 8 + 3)
#define                                 G2PHF3_bit          _BIT_ACCESS(COG2PHF,3)
// COG2PHF<G2PHF4>
extern volatile __bit                   G2PHF4              __at(0x3874);	// @ (0x70E * 8 + 4)
#define                                 G2PHF4_bit          _BIT_ACCESS(COG2PHF,4)
// COG2PHF<G2PHF5>
extern volatile __bit                   G2PHF5              __at(0x3875);	// @ (0x70E * 8 + 5)
#define                                 G2PHF5_bit          _BIT_ACCESS(COG2PHF,5)
// COG2PHR<G2PHR0>
extern volatile __bit                   G2PHR0              __at(0x3868);	// @ (0x70D * 8 + 0)
#define                                 G2PHR0_bit          _BIT_ACCESS(COG2PHR,0)
// COG2PHR<G2PHR1>
extern volatile __bit                   G2PHR1              __at(0x3869);	// @ (0x70D * 8 + 1)
#define                                 G2PHR1_bit          _BIT_ACCESS(COG2PHR,1)
// COG2PHR<G2PHR2>
extern volatile __bit                   G2PHR2              __at(0x386A);	// @ (0x70D * 8 + 2)
#define                                 G2PHR2_bit          _BIT_ACCESS(COG2PHR,2)
// COG2PHR<G2PHR3>
extern volatile __bit                   G2PHR3              __at(0x386B);	// @ (0x70D * 8 + 3)
#define                                 G2PHR3_bit          _BIT_ACCESS(COG2PHR,3)
// COG2PHR<G2PHR4>
extern volatile __bit                   G2PHR4              __at(0x386C);	// @ (0x70D * 8 + 4)
#define                                 G2PHR4_bit          _BIT_ACCESS(COG2PHR,4)
// COG2PHR<G2PHR5>
extern volatile __bit                   G2PHR5              __at(0x386D);	// @ (0x70D * 8 + 5)
#define                                 G2PHR5_bit          _BIT_ACCESS(COG2PHR,5)
// COG2CON1<G2POLA>
extern volatile __bit                   G2POLA              __at(0x38A0);	// @ (0x714 * 8 + 0)
#define                                 G2POLA_bit          _BIT_ACCESS(COG2CON1,0)
// COG2CON1<G2POLB>
extern volatile __bit                   G2POLB              __at(0x38A1);	// @ (0x714 * 8 + 1)
#define                                 G2POLB_bit          _BIT_ACCESS(COG2CON1,1)
// COG2CON1<G2POLC>
extern volatile __bit                   G2POLC              __at(0x38A2);	// @ (0x714 * 8 + 2)
#define                                 G2POLC_bit          _BIT_ACCESS(COG2CON1,2)
// COG2CON1<G2POLD>
extern volatile __bit                   G2POLD              __at(0x38A3);	// @ (0x714 * 8 + 3)
#define                                 G2POLD_bit          _BIT_ACCESS(COG2CON1,3)
// COG2CON1<G2RDBS>
extern volatile __bit                   G2RDBS              __at(0x38A7);	// @ (0x714 * 8 + 7)
#define                                 G2RDBS_bit          _BIT_ACCESS(COG2CON1,7)
// COG2RIS0<G2RIS0>
extern volatile __bit                   G2RIS0              __at(0x38A8);	// @ (0x715 * 8 + 0)
#define                                 G2RIS0_bit          _BIT_ACCESS(COG2RIS0,0)
// COG2RIS0<G2RIS1>
extern volatile __bit                   G2RIS1              __at(0x38A9);	// @ (0x715 * 8 + 1)
#define                                 G2RIS1_bit          _BIT_ACCESS(COG2RIS0,1)
// COG2RIS1<G2RIS10>
extern volatile __bit                   G2RIS10             __at(0x38B2);	// @ (0x716 * 8 + 2)
#define                                 G2RIS10_bit         _BIT_ACCESS(COG2RIS1,2)
// COG2RIS1<G2RIS11>
extern volatile __bit                   G2RIS11             __at(0x38B3);	// @ (0x716 * 8 + 3)
#define                                 G2RIS11_bit         _BIT_ACCESS(COG2RIS1,3)
// COG2RIS1<G2RIS12>
extern volatile __bit                   G2RIS12             __at(0x38B4);	// @ (0x716 * 8 + 4)
#define                                 G2RIS12_bit         _BIT_ACCESS(COG2RIS1,4)
// COG2RIS1<G2RIS13>
extern volatile __bit                   G2RIS13             __at(0x38B5);	// @ (0x716 * 8 + 5)
#define                                 G2RIS13_bit         _BIT_ACCESS(COG2RIS1,5)
// COG2RIS1<G2RIS14>
extern volatile __bit                   G2RIS14             __at(0x38B6);	// @ (0x716 * 8 + 6)
#define                                 G2RIS14_bit         _BIT_ACCESS(COG2RIS1,6)
// COG2RIS1<G2RIS15>
extern volatile __bit                   G2RIS15             __at(0x38B7);	// @ (0x716 * 8 + 7)
#define                                 G2RIS15_bit         _BIT_ACCESS(COG2RIS1,7)
// COG2RIS0<G2RIS2>
extern volatile __bit                   G2RIS2              __at(0x38AA);	// @ (0x715 * 8 + 2)
#define                                 G2RIS2_bit          _BIT_ACCESS(COG2RIS0,2)
// COG2RIS0<G2RIS3>
extern volatile __bit                   G2RIS3              __at(0x38AB);	// @ (0x715 * 8 + 3)
#define                                 G2RIS3_bit          _BIT_ACCESS(COG2RIS0,3)
// COG2RIS0<G2RIS4>
extern volatile __bit                   G2RIS4              __at(0x38AC);	// @ (0x715 * 8 + 4)
#define                                 G2RIS4_bit          _BIT_ACCESS(COG2RIS0,4)
// COG2RIS0<G2RIS5>
extern volatile __bit                   G2RIS5              __at(0x38AD);	// @ (0x715 * 8 + 5)
#define                                 G2RIS5_bit          _BIT_ACCESS(COG2RIS0,5)
// COG2RIS0<G2RIS6>
extern volatile __bit                   G2RIS6              __at(0x38AE);	// @ (0x715 * 8 + 6)
#define                                 G2RIS6_bit          _BIT_ACCESS(COG2RIS0,6)
// COG2RIS0<G2RIS7>
extern volatile __bit                   G2RIS7              __at(0x38AF);	// @ (0x715 * 8 + 7)
#define                                 G2RIS7_bit          _BIT_ACCESS(COG2RIS0,7)
// COG2RIS1<G2RIS8>
extern volatile __bit                   G2RIS8              __at(0x38B0);	// @ (0x716 * 8 + 0)
#define                                 G2RIS8_bit          _BIT_ACCESS(COG2RIS1,0)
// COG2RIS1<G2RIS9>
extern volatile __bit                   G2RIS9              __at(0x38B1);	// @ (0x716 * 8 + 1)
#define                                 G2RIS9_bit          _BIT_ACCESS(COG2RIS1,1)
// COG2RSIM0<G2RSIM0>
extern volatile __bit                   G2RSIM0             __at(0x38B8);	// @ (0x717 * 8 + 0)
#define                                 G2RSIM0_bit         _BIT_ACCESS(COG2RSIM0,0)
// COG2RSIM0<G2RSIM1>
extern volatile __bit                   G2RSIM1             __at(0x38B9);	// @ (0x717 * 8 + 1)
#define                                 G2RSIM1_bit         _BIT_ACCESS(COG2RSIM0,1)
// COG2RSIM1<G2RSIM10>
extern volatile __bit                   G2RSIM10            __at(0x38C2);	// @ (0x718 * 8 + 2)
#define                                 G2RSIM10_bit        _BIT_ACCESS(COG2RSIM1,2)
// COG2RSIM1<G2RSIM11>
extern volatile __bit                   G2RSIM11            __at(0x38C3);	// @ (0x718 * 8 + 3)
#define                                 G2RSIM11_bit        _BIT_ACCESS(COG2RSIM1,3)
// COG2RSIM1<G2RSIM12>
extern volatile __bit                   G2RSIM12            __at(0x38C4);	// @ (0x718 * 8 + 4)
#define                                 G2RSIM12_bit        _BIT_ACCESS(COG2RSIM1,4)
// COG2RSIM1<G2RSIM13>
extern volatile __bit                   G2RSIM13            __at(0x38C5);	// @ (0x718 * 8 + 5)
#define                                 G2RSIM13_bit        _BIT_ACCESS(COG2RSIM1,5)
// COG2RSIM1<G2RSIM14>
extern volatile __bit                   G2RSIM14            __at(0x38C6);	// @ (0x718 * 8 + 6)
#define                                 G2RSIM14_bit        _BIT_ACCESS(COG2RSIM1,6)
// COG2RSIM1<G2RSIM15>
extern volatile __bit                   G2RSIM15            __at(0x38C7);	// @ (0x718 * 8 + 7)
#define                                 G2RSIM15_bit        _BIT_ACCESS(COG2RSIM1,7)
// COG2RSIM0<G2RSIM2>
extern volatile __bit                   G2RSIM2             __at(0x38BA);	// @ (0x717 * 8 + 2)
#define                                 G2RSIM2_bit         _BIT_ACCESS(COG2RSIM0,2)
// COG2RSIM0<G2RSIM3>
extern volatile __bit                   G2RSIM3             __at(0x38BB);	// @ (0x717 * 8 + 3)
#define                                 G2RSIM3_bit         _BIT_ACCESS(COG2RSIM0,3)
// COG2RSIM0<G2RSIM4>
extern volatile __bit                   G2RSIM4             __at(0x38BC);	// @ (0x717 * 8 + 4)
#define                                 G2RSIM4_bit         _BIT_ACCESS(COG2RSIM0,4)
// COG2RSIM0<G2RSIM5>
extern volatile __bit                   G2RSIM5             __at(0x38BD);	// @ (0x717 * 8 + 5)
#define                                 G2RSIM5_bit         _BIT_ACCESS(COG2RSIM0,5)
// COG2RSIM0<G2RSIM6>
extern volatile __bit                   G2RSIM6             __at(0x38BE);	// @ (0x717 * 8 + 6)
#define                                 G2RSIM6_bit         _BIT_ACCESS(COG2RSIM0,6)
// COG2RSIM0<G2RSIM7>
extern volatile __bit                   G2RSIM7             __at(0x38BF);	// @ (0x717 * 8 + 7)
#define                                 G2RSIM7_bit         _BIT_ACCESS(COG2RSIM0,7)
// COG2RSIM1<G2RSIM8>
extern volatile __bit                   G2RSIM8             __at(0x38C0);	// @ (0x718 * 8 + 0)
#define                                 G2RSIM8_bit         _BIT_ACCESS(COG2RSIM1,0)
// COG2RSIM1<G2RSIM9>
extern volatile __bit                   G2RSIM9             __at(0x38C1);	// @ (0x718 * 8 + 1)
#define                                 G2RSIM9_bit         _BIT_ACCESS(COG2RSIM1,1)
// COG2STR<G2SDATA>
extern volatile __bit                   G2SDATA             __at(0x38FC);	// @ (0x71F * 8 + 4)
#define                                 G2SDATA_bit         _BIT_ACCESS(COG2STR,4)
// COG2STR<G2SDATB>
extern volatile __bit                   G2SDATB             __at(0x38FD);	// @ (0x71F * 8 + 5)
#define                                 G2SDATB_bit         _BIT_ACCESS(COG2STR,5)
// COG2STR<G2SDATC>
extern volatile __bit                   G2SDATC             __at(0x38FE);	// @ (0x71F * 8 + 6)
#define                                 G2SDATC_bit         _BIT_ACCESS(COG2STR,6)
// COG2STR<G2SDATD>
extern volatile __bit                   G2SDATD             __at(0x38FF);	// @ (0x71F * 8 + 7)
#define                                 G2SDATD_bit         _BIT_ACCESS(COG2STR,7)
// COG2STR<G2STRA>
extern volatile __bit                   G2STRA              __at(0x38F8);	// @ (0x71F * 8 + 0)
#define                                 G2STRA_bit          _BIT_ACCESS(COG2STR,0)
// COG2STR<G2STRB>
extern volatile __bit                   G2STRB              __at(0x38F9);	// @ (0x71F * 8 + 1)
#define                                 G2STRB_bit          _BIT_ACCESS(COG2STR,1)
// COG2STR<G2STRC>
extern volatile __bit                   G2STRC              __at(0x38FA);	// @ (0x71F * 8 + 2)
#define                                 G2STRC_bit          _BIT_ACCESS(COG2STR,2)
// COG2STR<G2STRD>
extern volatile __bit                   G2STRD              __at(0x38FB);	// @ (0x71F * 8 + 3)
#define                                 G2STRD_bit          _BIT_ACCESS(COG2STR,3)
// SSP1CON2<GCEN>
extern volatile __bit                   GCEN                __at(0x10B7);	// @ (0x216 * 8 + 7)
#define                                 GCEN_bit            _BIT_ACCESS(SSP1CON2,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// OSCSTAT<HFIOFL>
extern volatile __bit                   HFIOFL              __at(0x4D3);	// @ (0x9A * 8 + 3)
#define                                 HFIOFL_bit          _BIT_ACCESS(OSCSTAT,3)
// OSCSTAT<HFIOFR>
extern volatile __bit                   HFIOFR              __at(0x4D4);	// @ (0x9A * 8 + 4)
#define                                 HFIOFR_bit          _BIT_ACCESS(OSCSTAT,4)
// OSCSTAT<HFIOFS>
extern volatile __bit                   HFIOFS              __at(0x4D0);	// @ (0x9A * 8 + 0)
#define                                 HFIOFS_bit          _BIT_ACCESS(OSCSTAT,0)
// HIDRVC<HIDC4>
extern volatile __bit                   HIDC4               __at(0x2074);	// @ (0x40E * 8 + 4)
#define                                 HIDC4_bit           _BIT_ACCESS(HIDRVC,4)
// HIDRVC<HIDC5>
extern volatile __bit                   HIDC5               __at(0x2075);	// @ (0x40E * 8 + 5)
#define                                 HIDC5_bit           _BIT_ACCESS(HIDRVC,5)
// INLVLA<INLVLA0>
extern volatile __bit                   INLVLA0             __at(0x1C60);	// @ (0x38C * 8 + 0)
#define                                 INLVLA0_bit         _BIT_ACCESS(INLVLA,0)
// INLVLA<INLVLA1>
extern volatile __bit                   INLVLA1             __at(0x1C61);	// @ (0x38C * 8 + 1)
#define                                 INLVLA1_bit         _BIT_ACCESS(INLVLA,1)
// INLVLA<INLVLA2>
extern volatile __bit                   INLVLA2             __at(0x1C62);	// @ (0x38C * 8 + 2)
#define                                 INLVLA2_bit         _BIT_ACCESS(INLVLA,2)
// INLVLA<INLVLA3>
extern volatile __bit                   INLVLA3             __at(0x1C63);	// @ (0x38C * 8 + 3)
#define                                 INLVLA3_bit         _BIT_ACCESS(INLVLA,3)
// INLVLA<INLVLA4>
extern volatile __bit                   INLVLA4             __at(0x1C64);	// @ (0x38C * 8 + 4)
#define                                 INLVLA4_bit         _BIT_ACCESS(INLVLA,4)
// INLVLA<INLVLA5>
extern volatile __bit                   INLVLA5             __at(0x1C65);	// @ (0x38C * 8 + 5)
#define                                 INLVLA5_bit         _BIT_ACCESS(INLVLA,5)
// INLVLB<INLVLB4>
extern volatile __bit                   INLVLB4             __at(0x1C6C);	// @ (0x38D * 8 + 4)
#define                                 INLVLB4_bit         _BIT_ACCESS(INLVLB,4)
// INLVLB<INLVLB5>
extern volatile __bit                   INLVLB5             __at(0x1C6D);	// @ (0x38D * 8 + 5)
#define                                 INLVLB5_bit         _BIT_ACCESS(INLVLB,5)
// INLVLB<INLVLB6>
extern volatile __bit                   INLVLB6             __at(0x1C6E);	// @ (0x38D * 8 + 6)
#define                                 INLVLB6_bit         _BIT_ACCESS(INLVLB,6)
// INLVLB<INLVLB7>
extern volatile __bit                   INLVLB7             __at(0x1C6F);	// @ (0x38D * 8 + 7)
#define                                 INLVLB7_bit         _BIT_ACCESS(INLVLB,7)
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0x1C70);	// @ (0x38E * 8 + 0)
#define                                 INLVLC0_bit         _BIT_ACCESS(INLVLC,0)
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0x1C71);	// @ (0x38E * 8 + 1)
#define                                 INLVLC1_bit         _BIT_ACCESS(INLVLC,1)
// INLVLC<INLVLC2>
extern volatile __bit                   INLVLC2             __at(0x1C72);	// @ (0x38E * 8 + 2)
#define                                 INLVLC2_bit         _BIT_ACCESS(INLVLC,2)
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0x1C73);	// @ (0x38E * 8 + 3)
#define                                 INLVLC3_bit         _BIT_ACCESS(INLVLC,3)
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0x1C74);	// @ (0x38E * 8 + 4)
#define                                 INLVLC4_bit         _BIT_ACCESS(INLVLC,4)
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0x1C75);	// @ (0x38E * 8 + 5)
#define                                 INLVLC5_bit         _BIT_ACCESS(INLVLC,5)
// INLVLC<INLVLC6>
extern volatile __bit                   INLVLC6             __at(0x1C76);	// @ (0x38E * 8 + 6)
#define                                 INLVLC6_bit         _BIT_ACCESS(INLVLC,6)
// INLVLC<INLVLC7>
extern volatile __bit                   INLVLC7             __at(0x1C77);	// @ (0x38E * 8 + 7)
#define                                 INLVLC7_bit         _BIT_ACCESS(INLVLC,7)
// INTCON<INTE>
extern volatile __bit                   INTE                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 INTE_bit            _BIT_ACCESS(INTCON,4)
// OPTION_REG<INTEDG>
extern volatile __bit                   INTEDG              __at(0x4AE);	// @ (0x95 * 8 + 6)
#define                                 INTEDG_bit          _BIT_ACCESS(OPTION_REG,6)
// INTCON<INTF>
extern volatile __bit                   INTF                __at(0x59);	// @ (0xB * 8 + 1)
#define                                 INTF_bit            _BIT_ACCESS(INTCON,1)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0x1C98);	// @ (0x393 * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0x1C99);	// @ (0x393 * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0x1C9A);	// @ (0x393 * 8 + 2)
